{
    "backgrounds": [
        {
            "name": "Acolyte",
            "desc": "You have spent your life in the service of a temple to a specific god or pantheon of gods. You act as an intermediary between the realm of the holy and the mortal world, performing sacred rites and offering sacrifices in order to conduct worshipers into the presence of the divine. You are not necessarily a cleric—performing sacred rites is not the same thing as channeling divine power.\n\nChoose a god, a pantheon of gods, or some other quasi-divine being, and work with your DM to detail the nature of your religious service. The Gods of the Multiverse section contains a sample pantheon, from the Forgotten Realms setting. Were you a lesser functionary in a temple, raised from childhood to assist the priests in the sacred rites? Or were you a high priest who suddenly experienced a call to serve your god in a different way? Perhaps you were the leader of a small cult outside of any established temple structure, or even an occult group that served a fiendish master that you now deny. ",
            "proficiencies": [
                {
                    "name": "Insight"
                },
                {
                    "name": "Religion"
                }
            ],
            "features": [
                {
                    "name": "Shelter of the Faithful",
                    "desc": "As an acolyte, you command the respect of those who share your faith, and you can perform the religious ceremonies of your deity. You and your adventuring companions can expect to receive free healing and care at a temple, shrine, or other established presence of your faith, though you must provide any material components needed for spells. Those who share your religion will support you (but only you) at a modest lifestyle.\n\nYou might also have ties to a specific temple dedicated to your chosen deity or pantheon, and you have a residence there. This could be the temple where you used to serve, if you remain on good terms with it, or a temple where you have found a new home. While near your temple, you can call upon the priests for assistance, provided the assistance you ask for is not hazardous and you remain in good standing with your temple."
                }
            ],
            "languages": [
                {
                    "name": "Two languages of your choice",
                    "choose": 2,
                    "from": [
                        {
                            "index": "all_languages"
                        }
                    ]
                }
            ],
            "equipment": [
                {
                    "name": "A holy symbol (a gift to you when you entered the priesthood).",
                    "choose": 0
                },
                {
                    "name": "A prayer book or prayer wheel",
                    "choose": 1,
                    "from": [
                        {
                            "name": "prayer book"
                        },
                        {
                            "name": "prayer wheel"
                        }
                    ]
                },
                {
                    "name": "5 sticks of incense",
                    "choose": 0
                },
                {
                    "name": "vestments",
                    "choose": 0
                },
                {
                    "name": "a set of common clothes",
                    "choose": 0
                },
                {
                    "name": "a pouch containing 15 gp",
                    "index": "gold",
                    "value": 15,
                    "choose": 0
                }
            ]
        },
        {
            "name": "Anthropologist",
            "desc": "You have always been fascinated by other cultures, from the most ancient and primeval lost lands to the most modern civilizations. By studying other cultures’ customs, philosophies, laws, rituals, religious beliefs, languages, and art, you have learned how tribes, empires, and all forms of society in between craft their own destinies and doom. This knowledge came to you not only through books and scrolls, but also through first-hand observation—by visiting far-flung settlements and exploring local histories and customs. ",
            "proficiencies": [
                {
                    "name": "Insight"
                },
                {
                    "name": "Religion"
                }
            ],
            "features": [
            ],
            "languages": [
                {
                    "name": "Two languages of your choice",
                    "choose": 2,
                    "from": [
                        {
                            "index": "all_languages"
                        }
                    ]
                }
            ],
            "equipment": [
                {
                    "name": "A leather-bound diary",
                    "choose": 0
                },
                {
                    "name": "one trinket of special significance",
                    "choose": 0
                },
                {
                    "name": "a bottle of ink,",
                    "choose": 0
                },
                {
                    "name": "an ink pen",
                    "choose": 0
                },
                {
                    "name": " a set of traveler’s clothes",
                    "choose": 0
                },
                {
                    "name": "a pouch containing 10 gp",
                    "index": "gold",
                    "value": 10,
                    "choose": 0
                }
            ]
        },
        {
            "name": "Archaeologist",
            "desc": "You have always been fascinated by other cultures, from the most ancient and primeval lost lands to the most modern civilizations. By studying other cultures’ customs, philosophies, laws, rituals, religious beliefs, languages, and art, you have learned how tribes, empires, and all forms of society in between craft their own destinies and doom. This knowledge came to you not only through books and scrolls, but also through first-hand observation—by visiting far-flung settlements and exploring local histories and customs. ",
            "proficiencies": [
                {
                    "name": "History"
                },
                {
                    "name": "Survival"
                }
            ],
            "features": [
            ],
            "languages": [
                {
                    "name": "Two languages of your choice",
                    "choose": 2,
                    "from": [
                        {
                            "index": "all_languages"
                        }
                    ]
                }
            ],
            "equipment": [
                {
                    "name": "A wooden case containing a map to a ruin or dungeon",
                    "choose": 0
                },
                {
                    "name": "a bullseye lantern",
                    "choose": 0
                },
                {
                    "name": "a miner’s pick",
                    "choose": 0
                },
                {
                    "name": "a miner’s pick",
                    "choose": 0
                },
                {
                    "name": "a shovel",
                    "choose": 0
                },
                {
                    "name": "a two-person tent",
                    "choose": 0
                },
                {
                    "name": " a trinket recovered from a dig site",
                    "choose": 0
                },
                {
                    "name": "a pouch containing 25 gp",
                    "index": "gold",
                    "value": 25,
                    "choose": 0
                }
            ]
        },
        {
            "name": "Athlete",
            "desc": "You strive to perfect yourself physically and in execution of everything you do. The thrill of competition lights fire in your blood, and the roar of the crowd drives you forward. Tales of your exploits precede you and might open doors or loosen tongues. Whether in one of the poleis, between them, or among the nonhuman peoples of Theros, physical contests and those who pursue them command respect bordering on reverence. Athletes arise from all walks of life and all cultures and quite often cross paths with one another.",
            "proficiencies": [
                {
                    "name": "Acrobatics"
                },
                {
                    "name": "Athletics"
                },
                {
                    "name": "Vehicles (Land)"
                }
            ],
            "features": [
            ],
            "languages": [
                {
                    "name": "One language of your choice",
                    "choose": 1,
                    "from": [
                        {
                            "index": "all_languages"
                        }
                    ]
                }
            ],
            "equipment": [
                {
                    "name": "A bronze discus or leather ball",
                    "choose": 0
                },
                {
                    "name": "a bullseye lantern",
                    "choose": 0
                },
                {
                    "name": "a lucky charm or past trophy",
                    "choose": 0
                },
                {
                    "name": " a set of traveler’s clothes",
                    "choose": 0
                },
                {
                    "name": "a pouch containing 10 gp",
                    "index": "gold",
                    "value": 10,
                    "choose": 0
                }
            ]
        },
        {
            "name": "Azorius Functionary",
            "desc": "The brutes are at the gate, chaos is looming, and the only thing standing in the way of disaster is the foundation of law and order—as embodied in the Azorius Senate. You’re a proud member of the Azorius guild, which both enacts and enforces the laws that make Ravnican society function smoothly and safely.",
            "proficiencies": [
                {
                    "name": "Insight"
                },
                {
                    "name": "Intimidation"
                }
            ],
            "features": [
                {
                    "name": "Legal Authority",
                    "desc": "You have the authority to enforce the laws of Ravnica, and that status inspires a certain amount of respect and even fear in the populace. People mind their manners in your presence and avoid drawing your attention; they assume you have the right to be wherever you are. Showing your Azorius insignia gets you an audience with anyone you want to talk to (though it might cause more problems than it solves when you’re dealing with incorrigible lawbreakers). If you abuse this privilege, though, you can get in serious trouble with your superiors and even be stripped of your position."
                }
            ],
            "languages": [
                {
                    "name": "Two languages of your choice",
                    "choose": 2,
                    "from": [
                        {
                            "index": "all_languages"
                        }
                    ]
                }
            ],
            "spells": [
                {
                    "name": "friends"
                },
                {
                    "name" : "message"
                },
                {
                    "name" : "command"
                },
                {
                    "name" : "ensnaring strike"
                },
                {
                    "name" : "arcane lock"
                },
                {
                    "name" : "calm emotions"
                },
                {
                    "name" : "hold person"
                },
                {
                    "name" : "clairvoyance"
                },
                {
                    "name" : "compulsion"
                },
                {
                    "name" : "counterspell"
                },
                {
                    "name" : "divination"
                },
                {
                    "name" : "dominate person"
                }
            ],
            "equipment": [
                {
                    "name": "An Azorius insignia",
                    "choose": 0
                },
                {
                    "name": "a scroll containing the text of a law important to you",
                    "choose": 0
                },
                {
                    "name": "a bottle of blue ink",
                    "choose": 0
                },
                {
                    "name": " a pen",
                    "choose": 0
                },
                {
                    "name": "a set of fine clothes",
                    "choose": 0
                },
                {
                    "name": "a pouch containing 10 gp (Azorius-minted 1-zino coins)",
                    "index": "gold",
                    "value": 10,
                    "choose": 0
                }
            ]
        },
        {
            "name": "Boros Legionnaire",
            "desc": "As a member of the Boros Legion, your life is devoted to the service of angels and consecrated to the work of establishing justice and peace on the streets of Ravnica. You might be a true believer, inspired by the example of the angels, moved by the plight of the downtrodden, and devoted to the cause of justice. Or you could be a cynic in the ranks, perhaps because you reluctantly followed in the footsteps of a Boros parent, succumbed to the persuasion of a charismatic recruiter’s lofty promises, or were drawn in by the prospect of a life of action.",
            "proficiencies": [
                {
                    "name": "Athletics,"
                },
                {
                    "name": "Intimidation"
                },
                {
                    "name": "One type of gaming set",
                    "choose": 1,
                    "from": [
                        {
                            "index": "gaming_sets"
                        }
                    ]
                }
            ],
            "features": [
                {
                    "name": "Feature: Legion Station",
                    "desc": "You have an established place in the hierarchy of the Boros Legion. You can requisition simple equipment for temporary use, and you can gain access to any Boros garrison in Ravnica, where you can rest in safety and receive the attention of medics. You are also paid a salary of 1 gp (a Boros-minted 1-zino coin) per week, which (combined with free lodging in your garrison) enables you to maintain a poor lifestyle between adventures."
                }
            ],
            "languages": [
                {
                    "name": "Choose one of Celestial, Draconic, Goblin, or Minotaur",
                    "choose": 1,
                    "from": [
                        {
                            "name": "Celestial"
                        },
                        {
                            "name": "Draconic"
                        },
                        {
                            "name": "Goblin"
                        },
                        {
                            "name": "Minotaur"
                        }
                    ]
                }
            ],
            "spells": [
                {
                    "name": "fire bolt"
                },
                {
                    "name" : "sacred flame"
                },
                {
                    "name" : "guiding bolt"
                },
                {
                    "name" : "heroism"
                },
                {
                    "name" : "aid"
                },
                {
                    "name" : "scorching ray"
                },
                {
                    "name" : "beacon of hope"
                },
                {
                    "name" : "blinding smite"
                },
                {
                    "name" : "death ward"
                },
                {
                    "name" : "wall of fire"
                },
                {
                    "name" : "flame strike"
                }
            ],
            "equipment": [
                {
                    "name": " A Boros insignia",
                    "choose": 0
                },
                {
                    "name": " a feather from an angel’s wing",
                    "choose": 0
                },
                {
                    "name": " a tattered piece of a Boros banner (a souvenir from a famous battle)",
                    "choose": 0
                },
                {
                    "name": "a set of common clothes",
                    "choose": 0
                },
                {
                    "name": "a belt pouch containing 2 gp (Boros-minted 1-zino coins))",
                    "index": "gold",
                    "value": 10,
                    "choose": 0
                }
            ]
        },
        {
            "name": "Charlatan",
            "desc": "You have always had a way with people. You know what makes them tick, you can tease out their hearts' desires after a few minutes of conversation, and with a few leading questions you can read them like they were children's books. It's a useful talent, and one that you're perfectly willing to use for your advantage.\n\nYou know what people want and you deliver, or rather, you promise to deliver. Common sense should steer people away from things that sound too good to be true, but common sense seems to be in short supply when you're around. The bottle of pink colored liquid will surely cure that unseemly rash, this ointment – nothing more than a bit of fat with a sprinkle of silver dust can restore youth and vigor, and there's a bridge in the city that just happens to be for sale. These marvels sound implausible, but you make them sound like the real deal.",
            "proficiencies": [
                {
                    "name": "Deception,"
                },
                {
                    "name": "Sleight of Hand"
                },
                {
                    "name": "Disguise kit",
                    "choose": 0
                },
                {
                    "name": "Forgery kit",
                    "choose": 0
                }
            ],
            "features": [
                {
                    "name": "Feature: False Identity",
                    "desc": "You have created a second identity that includes documentation, established acquaintances, and disguises that allow you to assume that persona. Additionally, you can forge documents including official papers and personal letters, as long as you have seen an example of the kind of document or the handwriting you are trying to copy."
                }
            ],
            "equipment": [
                {
                    "name": "a set of fine clothes",
                    "choose": 0
                },
                {
                    "name": "a disguise kit",
                    "choose": 0
                },
                {
                    "name": "Tools of the con of your choice",
                    "choose": 1,
                    "from" : [
                        {
                            "name" : "ten stoppered bottles filled with colored liquid"
                        },
                        {
                            "name" : "a set of weighted dice"
                        },
                        {
                            "name" : "a set of weighted dice"
                        },
                        {
                            "name" : "a deck of marked cards"
                        },
                        {
                            "name" : "a signet ring of an imaginary duke"
                        }
                    ]
                },
                {
                    "name": "a pouch containing 15 gp",
                    "index": "gold",
                    "value": 15,
                    "choose": 0
                }
            ]
        },
        {
            "name": "City Watch / Investigator",
            "desc": "You have served the community where you grew up, standing as its first line of defense against crime. You aren’t a soldier, directing your gaze outward at possible enemies. Instead, your service to your hometown was to help police its populace, protecting the citizenry from lawbreakers and malefactors of every stripe. You might have been part of the City Watch of Waterdeep, the baton-wielding police force of the City of Splendors, protecting the common folk from thieves and rowdy nobility alike. Or you might have been one of the valiant defenders of Silverymoon, a member of the Silverwatch or even one of the magic-wielding Spellguard. Perhaps you hail from Neverwinter and have served as one of its Wintershield watchmen, the newly founded branch of guards who vow to keep safe the City of Skilled Hands. Even if you’re not city-born or city-bred, this background can describe your early years as a member of law enforcement. Most settlements of any size have their own constables and police forces, and even smaller communities have sheriffs and bailiffs who stand ready to protect their community.",
            "proficiencies": [
                {
                    "name": " Athletics,"
                },
                {
                    "name": "Insight"
                }
            ],
            "features": [
                {
                    "name": "Feature: Watcher’s Eye",
                    "desc": "Your experience in enforcing the law, and dealing with lawbreakers, gives you a feel for local laws and criminals. You can easily find the local outpost of the watch or a similar organization, and just as easily pick out the dens of criminal activity in a community, although you’re more likely to be welcome in the former locations rather than the latter."
                }
            ],
            "languages": [
                {
                    "name": "Two languages of your choice",
                    "choose": 2,
                    "from": [
                        {
                            "index": "all_languages"
                        }
                    ]
                }
            ],
            "equipment": [
                {
                    "name": "A uniform in the style of your unit and indicative of your rank",
                    "choose": 0
                },
                {
                    "name": "a horn with which to summon help",
                    "choose": 0
                },
                {
                    "name": "a set of manacles",
                    "choose": 0
                },
                {
                    "name": "a pouch containing 10 gp",
                    "index": "gold",
                    "value": 10,
                    "choose": 0
                }
            ]
        },
        {
            "name": "Clan Crafter",
            "desc": "The Stout Folk are well known for their artisanship and the worth of their handiworks, and you have been trained in that ancient tradition. For years you labored under a dwarf master of the craft, enduring long hours and dismissive, sour-tempered treatment in order to gain the fine skills you possess today.",
            "proficiencies": [
                {
                    "name": "History,"
                },
                {
                    "name": "Insight"
                },
                {
                    "name": "One type of artisan’s tools TODO",
                    "choose": 1
                }
            ],
            "features": [

            ],
            "languages": [
                {
                    "name": "Dwarvish or one other of your choice if you already speak Dwarvish",
                    "choose": 2,
                    "from": [
                        {
                            "index": "all_languages"
                        }
                    ]
                }
            ],
            "equipment": [
                {
                    "name": "TODO A set of artisan’s tools with which you are proficient",
                    "choose": 0
                },
                {
                    "name": "TODO? a maker’s mark chisel used to mark your handiwork with the symbol of the clan of crafters you learned your skill from",
                    "choose": 0
                },
                {
                    "name": "a set of traveler’s clothes,",
                    "choose": 0
                },
                {
                    "name": "TODO and a pouch containing 5 gp",
                    "index": "gold",
                    "value": 5,
                    "choose": 0
                },
                {
                    "name" : "a gem worth 10 gp"
                }
            ]
        },
        {
            "name": "Cloistered Scholar",
            "desc": "As a child, you were inquisitive when your playmates were possessive or raucous. In your formative years, you found your way to one of Faerûn’s great institutes of learning , where you were apprenticed and taught that knowledge is a more valuable treasure than gold or gems. Now you are ready to leave your home—not to abandon it, but to quest for new lore to add to its storehouse of knowledge. The most well known of Faerûn’s fonts of knowledge is Candlekeep. The great library is always in need of workers and attendants, some of whom rise through the ranks to assume roles of greater responsibility and prominence. You might be one of Candlekeep’s own, dedicated to the curatorship of what is likely the most complete body of lore and history in all the world. Perhaps instead you were taken in by the scholars of the Vault of the Sages or the Map House in Silverymoon, and now you have struck out to increase your knowledge and to make yourself available to help those in other places who seek your expertise. You might be one of the few who aid Herald’s Holdfast, helping to catalogue and maintain records of the information that arrives daily from across Faerûn.",
            "proficiencies": [
                {
                    "name": "History"
                },
                {
                    "name": "One of your choice of one from among Arcana, Nature, and Religion",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "Arcana"
                        },
                        {
                            "name" : "Nature"
                        },
                        {
                            "name" : "Religion"
                        }
                    ]
                }
            ],
            "features": [
            ],
            "languages": [
                {
                    "name": "Two languages of your choice",
                    "choose": 2,
                    "from": [
                        {
                            "index": "all_languages"
                        }
                    ]
                }
            ],
            "equipment": [
                {
                    "name": "The scholar’s robes of your cloister",
                    "choose": 0
                },
                {
                    "name": "a writing kit (small pouch with a quill, ink, folded parchment, and a small penknife)",
                    "choose": 0
                },
                {
                    "name": "a borrowed book on the subject of your current study",
                    "choose": 0
                },
                {
                    "name": "a pouch containing 10 gp",
                    "index": "gold",
                    "value": 10,
                    "choose": 0
                }
            ]
        },
        {
            "name": "Courtier",
            "desc": "In your earlier days, you were a personage of some significance in a noble court or a bureaucratic organization. You might or might not come from an upper-class family; your talents, rather than the circumstances of your birth, could have secured you this position.\n\nYou might have been one of the many functionaries, attendants, and other hangers-on in the Court of Silverymoon, or perhaps you traveled in Waterdeep's baroque and sometimes cutthroat conglomeration of guilds, nobles, adventurers, and secret societies. You might have been one of the behind-the-scenes law-keepers or functionaries in Baldur's Gate or Neverwinter, or you might have grown up in and around the castle of Daggerford.\n\nEven if you are no longer a full-fledged member of the group that gave you your start in life, your relationships with your former fellows can be an advantage for you and your adventuring comrades. You might undertake missions with your new companions that further the interest of the organization that gave you your start in life. In any event, the abilities that you honed while serving as a courtier will stand you in good stead as an adventurer.",
            "features": [
                {
                    "name" : "Court Functionary",
                    "desc" : "Your knowledge of how bureaucracies function lets you gain access to the records and inner workings of any noble court or government you encounter. You know who the movers and shakers are, whom to go to for the favors you seek, and what the current intrigues of interest in the group are."
                }
            ],
            "equipment": [
                {
                    "name" : "A set of fine clothes"
                },
                {
                    "name" : "A pouch containing 5gp",
                    "index" : "gold",
                    "amount" : 5
                }
            ],
            "proficiencies": [
                {
                    "name" : "Insight"
                },
                {
                    "name" : "Persuasion"
                }
            ],
            "languages": [
                {
                    "name" : "Two languages of your choice",
                    "choose" : 2,
                    "from" : [
                        {
                            "index" : "all_languages"
                        }
                    ]
                }
            ]
        },
        {
            "name": "Criminal",
            "desc": "You are an experienced criminal with a history of breaking the law. You have spent a lot of time among other criminals and still have contacts within the criminal underworld. You're far closer than most people to the world of murder, theft, and violence that pervades the underbelly of civilization, and you have survived up to this point by flouting the rules and regulations of society.",
            "features": [
                {
                    "name" : "Criminal Specialty",
                    "desc" : "There are many kinds of criminals, and within a thieves' guild or similar criminal organization, individual members have particular specialties. Even criminals who operate outside of such organizations have strong preferences for certain kinds of crimes over others. Choose the role you played in your criminal life, or roll on the table below.",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "Blackmailer"
                        },
                        {
                            "name" : "Burglar"
                        },
                        {
                            "name" : "Enforcer"
                        },
                        {
                            "name" : "Fence"
                        },
                        {
                            "name": "Highway robber"
                        },
                        {
                            "name" : "Hired killer"
                        },
                        {
                            "name" : "Pickpocket"
                        },
                        {
                            "name" : "Smuggler"
                        }
                    ]
                },
                {
                    "name" : "Criminal Contact",
                    "desc" : "You have a reliable and trustworthy contact who acts as your liaison to a network of other criminals. You know how to get messages to and from your contact, even over great distances; specifically, you know the local messengers, corrupt caravan masters, and seedy sailors who can deliver messages for you."
                }
            ],
            "equipment": [
                {
                    "name" : "A crowbar"
                },
                {
                    "name" : "A set of dark common clothes including a hood"
                },
                {
                    "name" : "A pouch containing 15gp",
                    "index" : "gold",
                    "amount" : 15
                }
            ],
            "proficiencies": [
                {
                    "name" : "Deception"
                },
                {
                    "name" : "Stealth"
                },
                {
                    "name" : "One type of gaming set",
                    "choose" : 1,
                    "from" : [
                        {
                            "index" : "gaming_sets"
                        }
                    ]
                },
                {
                    "name" : "Thieves' tools"
                }
            ],
            "languages": [
            ]
        },
        {
            "name": "Entertainer",
            "desc": "You thrive in front of an audience. You know how to entrance them, entertain them, and even inspire them. Your poetics can stir the hearts of those who hear you, awakening grief or joy, laughter or anger. Your music raises their spirits or captures their sorrow. Your dance steps captivate, your humor cuts to the quick. Whatever techniques you use, your art is your life.",
            "features": [
                {
                    "name" : "Entertainer Routines",
                    "desc" : "A good entertainer is versatile, spicing up every performance with a variety of different routines. Choose one to three routines or roll on the table below to define your expertise as an entertainer.",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "Actor"
                        },
                        {
                            "name" : "Dancer"
                        },
                        {
                            "name" : "Fire-eater"
                        },
                        {
                            "name" : "Jester"
                        },
                        {
                            "name" : "Juggler"
                        },
                        {
                            "name" : "Instrumentalist"
                        },
                        {
                            "name" : "Poet"
                        },
                        {
                            "name" : "Singer"
                        },
                        {
                            "name" : "Singer"
                        },
                        {
                            "name" : "Storyteller"
                        },
                        {
                            "name" : "Tumbler"
                        }
                    ]
                },
                {
                    "name" : "By Popular Demand",
                    "desc" : "You can always find a place to perform, usually in an inn or tavern but possibly with a circus, at a theater, or even in a noble's court. At such a place, you receive free lodging and food of a modest or comfortable standard (depending on the quality of the establishment), as long as you perform each night. In addition, your performance makes you something of a local figure. When strangers recognize you in a town where you have performed, they typically take a liking to you."
                }
            ],
            "equipment": [
                {
                    "name" : "A musical instrument of your choice",
                    "choose" : 1,
                    "from" : [
                        {
                            "index" : "musical_instruments"
                        }
                    ]
                },
                {
                    "name" : "The favor of an admirer",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "Love letter"
                        },
                        {
                            "name" : "Lock of hair"
                        },
                        {
                            "name" : "Trinket"
                        }
                    ]
                },
                {
                    "name" : "A costume"
                },
                {
                    "name" : "A pouch containing 15gp",
                    "index" : "gold",
                    "amount" : 15
                }
            ],
            "proficiencies": [
                {
                    "name" : "Acrobatics"
                },
                {
                    "name" : "Performance"
                },
                {
                    "name" : "Disguise kit"
                },
                {
                    "name" : "One musical instrument of your choice",
                    "choose" : 1,
                    "from" : [
                        {
                            "index" : "musical_instruments"
                        }
                    ]
                }
            ],
            "languages": [
            ]
        },
        {
            "name": "Faceless",
            "desc": "Being who you are, you could never be a hero. Whether due to your class, your people, your family, or your sins, something about you prevents you from effectively pursuing the path you've chosen. Even so, that doesn't stop you. You've left your old face behind, taking on a new persona, becoming something more.\n\nCharacters with the faceless background don a disguise—literally or otherwise—as they adventure. This persona might be dramatic or subtle. In a way, though, many characters have such larger than life personalities. Therefore, this background largely focuses on detailing the hero behind the mask.",
            "features": [
                {
                    "name" : "Faceless Persona",
                    "desc" : "A faceless character adventures behind a mask of a public persona. This persona is as natural to them as their hidden, true face, but it disguises their identity. Roll on the Faceless Persona table to determine your persona, or work with the DM to create a persona that's unique to your character and suits the tone of your game.",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "A flamboyant spy or brigand"
                        },
                        {
                            "name" : "The incarnation of a nation or people"
                        },
                        {
                            "name" : "A scoundrel with a masked guise"
                        },
                        {
                            "name" : "A vengeful spirit"
                        },
                        {
                            "name" : "The manifestation of a deity or your faith"
                        },
                        {
                            "name" : "One whose beauty is greatly accented using makeup"
                        },
                        {
                            "name" : "An impersonation of another hero"
                        },
                        {
                            "name" : "The embodiment of a school of magic"
                        },
                        {
                            "name" : "A warrior with distinctive armor"
                        },
                        {
                            "name" : "A disguise with animalistic or monstrous characteristics, meant to inspire fear"
                        }
                    ]
                },
                {
                    "name" : "Dual Personalities",
                    "desc" : "Most of your fellow adventurers and the world know you as your persona. Those who seek to learn more about you—your weakness, your origins, your purpose—find themselves stymied by your disguise. Upon donning a disguise and behaving as your persona, you are unidentifiable as your true self. By removing your disguise and revealing your true face, you are no longer identifiable as your persona. This allows you to change appearances between your two personalities as often as you wish, using one to hide the other or serve as convenient camouflage. However, should someone realize the connection between your persona and your true self, your deception might lose its effectiveness."
                }
            ],
            "equipment": [
                {
                    "name" : "A disguise kit"
                },
                {
                    "name" : "A costume"
                },
                {
                    "name" : "A pouch containing 10gp",
                    "index" : "gold",
                    "amount" : 10
                }
            ],
            "proficiencies": [
                {
                    "name" : "Deception"
                },
                {
                    "name" : "Intimidation"
                },
                {
                    "name"  : "Disguise kit"
                }
            ],
            "languages": [
                {
                    "name" : "One language of your choice",
                    "choose" : 1,
                    "from" : [
                        {
                            "index" : "all_languages"
                        }
                    ]
                }
            ]
        },
        {
            "name": "Faction Agent",
            "desc": "Many organizations active in the North and across the face of Faerûn aren't bound by strictures of geography. These factions pursue their agendas without regard for political boundaries, and their members operate anywhere the organization deems necessary. These groups employ listeners, rumormongers, smugglers, sellswords, cache-holders (people who guard caches of wealth or magic for use by the faction's operatives), haven keepers, and message drop minders, to name a few. At the core of every faction are those who don't merely fulfill a small function for that organization, but who serve as its hands, head, and heart.\n\nAs a prelude to your adventuring career (and in preparation for it), you served as an agent of a particular faction in Faerûn. You might have operated openly or secretly, depending on the faction and its goals, as well as how those goals mesh with your own. Becoming an adventurer doesn't necessarily require you to relinquish membership in your faction (though you can choose to do so), and it might enhance your status in the faction.",
            "features": [
                {
                    "name" : "Factions of the Sword Coast",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "The Harpers",
                            "desc" : "Founded more than a millennium ago, disbanded and reorganized several times, the Harpers remain a powerful, behind-the-scenes agency, which acts to thwart evil and promote fairness through knowledge, rather than brute force. Harper agents are often proficient in Investigation, enabling them to be adept at snooping and spying. They often seek aid from other Harpers, sympathetic bards and innkeepers, rangers, and the clergy of gods that are aligned with the Harpers' ideals."
                        },
                        {
                            "name" : "The Order of the Gauntlet",
                            "desc" : "One of the newest power groups in Faerûn, the Order of the Gauntlet has an agenda similar to that of the Harpers. Its methods are vastly different, however: bearers of the gauntlet are holy warriors on a righteous quest to crush evil and promote justice, and they never hide in the shadows. Order agents tend to be proficient in Religion, and frequently seek aid from law enforcement friendly to the order's ideals, and the clergy of the order's patron gods."
                        },
                        {
                            "name" : "The Emerald Enclave",
                            "desc" : "Maintaining balance in the natural order and combating the forces that threaten that balance is the twofold goal of the Emerald Enclave. Those who serve the faction are masters of survival and living off the land. They are often proficient in Nature, and can seek assistance from woodsmen, hunters, rangers, barbarian tribes, druid circles, and priests who revere the gods of nature."
                        },
                        {
                            "name" : "The Lords' Alliance",
                            "desc" : "On one level, the agents of the Lords' Alliance are representatives of the cities and other governments that constitute the alliance. But, as a faction with interests and concerns that transcend local politics and geography, the Alliance has its own cadre of individuals who work on behalf of the organizations, wider agenda. Alliance agents are required to be knowledgeable in History, and can always rely on the aid of the governments that are part of the Alliance, plus other leaders and groups who uphold the Alliance's ideals."
                        },
                        {
                            "name" : "The Zhentarim",
                            "desc" : "In recent years, the Zhentarim have become more visible in the world at large, as the group works to improve its reputation among the common people. The faction draws employees and associates from many walks of life, setting them to tasks that serve the goals of the Black Network but aren't necessarily criminal in nature. Agents of the Black Network must often work in secret, and are frequently proficient in Deception. They seek aid from the wizards, mercenaries, merchants and priesthoods allied with the Zhentarim."
                        },
                        {
                            "name" : "Safe Haven",
                            "desc" : "As a faction agent, you have access to a secret network of supporters and operatives who can provide assistance on your adventures. You know a set of secret signs and passwords you can use to identify such operatives, who can provide you with access to a hidden safe house, free room and board, or assistance in finding information. These agents never risk their lives for you or risk revealing their true identities."
                        }
                    ]
                }
            ],
            "equipment": [
                {
                    "name" : "The badge or emblem of your faction",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "The badge of your faction"
                        },
                        {
                            "name" : "The emblem of your faction"
                        }
                    ]
                },
                {
                    "name" : "A seminal faction text"
                },
                {
                    "name" : "A set of common clothes"
                },
                {
                    "name" : "A pouch containing 15gp",
                    "index" : "gold",
                    "amount" : 15
                }
            ],
            "proficiencies": [
                {
                    "name" :"Insight"
                },
                {
                    "name" : "Your choice of Intelligence, Wisdom, or Charisma",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "Intelligence"
                        },
                        {
                            "name" : "Wisdom"
                        },
                        {
                            "name" : "Charisma"
                        }
                    ]
                }
            ],
            "languages": [
                {
                    "name" : "Two languages of your choice",
                    "choose" : 1,
                    "from" : [
                        {
                            "index" : "all_languages"
                        }
                    ]
                }
            ]
        },
        {
            "name": "Far Traveler",
            "desc": "Almost all of the common people and other folk that one might encounter along the Sword Coast or in the North have one thing in common: they live out their lives without ever traveling more than a few miles from where they were born.\n\nYou aren't one of those folk.\n\nYou are from a distant place, one so remote that few of the common folk in the North realize that it exists, and chances are good that even if some people you meet have heard of your homeland, they know merely the name and perhaps a few outrageous stories. You have come to this part of Faerûn for your own reasons, which you might or might not choose to share.\n\nAlthough you will undoubtedly find some of this land's ways to be strange and discomfiting, you can also be sure that some things its people take for granted will be to you new wonders that you've never laid eyes on before. By the same token, you're a person of interest, for good or ill, to those around you almost anywhere you go.",
            "features": [
                {
                    "name" : "Why Are You Here?",
                    "desc" : "A far traveler might have set out on a journey for one of a number of reasons, and the departure from his or her homeland could have been voluntary or involuntary. To determine why you are so far from home, roll on the table below or choose from the options provided. The following section, discussing possible homelands, includes some suggested reasons that are appropriate for each location.",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "Emissary"
                        },
                        {
                            "name" : "Exile"
                        },
                        {
                            "name" : "Fugitive"
                        },
                        {
                            "name" : "Pilgrim"
                        },
                        {
                            "name" : "Sightseer"
                        },
                        {
                            "name" : "Wanderer"
                        }
                    ]
                },
                {
                    "name" : "Where Are You From?",
                    "desc" : "The most important decision in creating a far traveler background is determining your homeland. The places discussed here are all sufficiently distant from the North and the Sword Coast to justify the use of this background.",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "Evermeet",
                            "desc" : "The fabled elven islands far to the west are home to elves who have never been to Faerun. They often find it a harsher place than they expected when they do make the trip. If you are an elf, Evermeet is a logical (though not mandatory) choice for your homeland.\n\nMost of those who emigrate from Evermeet are either exiles, forced out for committing some infraction of elven law, or emissaries who come to Faerun for a purpose that benefits elven culture or society."
                        },
                        {
                            "name" : "Halruaa",
                            "desc" : "Located on the southern edges of the Shining South, and hemmed in by mountains all around, the magocracy of Halruaa is a bizarre land to most in Faerun who know about it. Many folk have heard of the strange skyships the Halruaans sail, and a few know of the tales that even the least of their people can work magic.\n\nHalruaans usually make their journeys into Faerun for personal reasons, since their government has a strict stance against unauthorized involvement with other nations and organizations. You might have been exiled for breaking one of Halruaa's many byzantine laws, or you could be a pilgrim who seeks the shrines of the gods of magic."
                        },
                        {
                            "name" : "Kara-Tur",
                            "desc" : "The continent of Kara-Tur, far to the east of Faerûn, is home to people whose customs are unfamiliar to the folk of the Sword Coast. If you come from Kara-Tur, the people of Faerûn likely refer to you as Shou, even if that isn't your true ethnicity, because that's the blanket term they use for everyone who shares your origin.\n\nThe folk of Kara-Tur occasionally travel to Faerûn as diplomats or to forge trade relations with prosperous merchant cartels. You might have come here as part of some such delegation, then decided to stay when the mission was over."
                        },
                        {
                            "name" : "Mulhorand",
                            "desc": "From the terrain to the architecture to the god-kings who rule over these lands, nearly everything about Mulhorand is a lien to someone from the Sword Coast. You likely experienced the same sort of culture shock when you left your desert home and traveled to the unfamiliar climes of northern Faerûn. Recent events in your homeland have led to the abolition of slavery, and a corresponding increase in the traffic between Mulhorand and the distant parts of Faerûn.\n\nThose who leave behind Mulhorand's sweltering deserts and ancient pyramids for a glimpse at a different life do so for many reasons. You might be in the North simply to see the strangeness this wet land has to offer, or because you have made too many enemies among the desert communities of your home."
                        },
                        {
                            "name" : "Sossal",
                            "desc" : "Few have heard of your homeland, but many have questions about it upon seeing you. Humans from Sossal seem crafted from snow, with alabaster skin and white hair, and typically dressed in white.\n\nSossal exists far to the northeast, hard up against the endless ice to the north and bounded on its other sides by hundreds of miles of the Great Glacier and the Great Ice Sea. No one from your nation makes the effort to cross such colossal barriers without a convincing reason. You must fear something truly terrible or seek something incredibly important."
                        },
                        {
                            "name" : "Zakhara",
                            "desc" : "As the saying goes among those in Faerûn who know of the place, \"To get to Zakhara, go south. Then go south some more.\" Of course, you followed an equally long route when you came north from your place of birth. Though it isn't unusual for Zakharans to visit the southern extremes of Faerûn for trading purposes, few of them stray as far from home as you have.\n\nYou might be traveling to discover what wonders are to be found outside the deserts and sword-like mountains of your homeland, or perhaps you are on a pilgrimage to understand the gods that others worship, so that you might better appreciate your own deities."
                        },
                        {
                            "name" : "The Underdark",
                            "desc" : "Though your home is physically closer to the Sword Coast than the other locations discussed here, it is far more unnatural. You hail from one of the settlements in the Underdark, each of which has its own strange customs and laws. If you are a native of one of the great subterranean cities or settlements, you are probably a member of the race that occupies the place but you might also have grown up there after being captured and brought below when you were a child.\n\nIf you are a true Underdark native, you might have come to the surface as an emissary of your people, or perhaps to escape accusations of criminal behavior (whether warranted or not). If you aren't a native, your reason for leaving \"home\" probably has something to do with getting away from a bad situation."
                        }
                    ]
                },
                {
                    "name" : "All Eyes on You",
                    "desc" : "Your accent, mannerisms, figures of speech, and perhaps even your appearance all mark you as foreign. Curious glances are directed your way wherever you go, which can be a nuisance, but you also gain the friendly interest of scholars and others intrigued by far-off lands, to say nothing of everyday folk who are eager to hear stories of your homeland.\n\nYou can parley this attention into access to people and places you might not otherwise have, for you and your traveling companions. Noble lords, scholars, and merchant princes, to name a few, might be interested in hearing about your distant homeland and people."
                }
            ],
            "equipment": [
                {
                    "name" : "Travelers clothes"
                },
                {
                    "name" : "Any musical instrument or gaming set you are proficient with",
                    "todo" : "IMPL",
                    "choose" : 1,
                    "from" : [
                        {
                            "index" : "gaming_sets"
                        },
                        {
                            "index" : "musical_instruments"
                        }
                    ]
                },
                {
                    "name" : "Poorly wrought maps from your homeland that depict where you are in Faerûn"
                },
                {
                    "name" : "A small piece of jewelry worth 10gp in the style of your homeland's craftsmanship"
                },
                {
                    "name" : "A pouch containing 5gp",
                    "index" : "gold",
                    "amount" : 5
                }
            ],
            "proficiencies": [
                {
                    "name" : "Insight"
                },
                {
                    "name" : "Perception"
                },
                {
                    "name" : "Any one musical instrument or gaming set of your choice",
                    "choose" : 1,
                    "from" : [
                        {
                            "index" : "gaming_sets"
                        },
                        {
                            "index" : "musical_instruments"
                        }
                    ]
                }
            ],
            "languages": [
                {
                    "name": "Any language of your choice",
                    "choose" : 1,
                    "from" : [
                        {
                            "index" : "all_languages"
                        }
                    ]
                }
            ]
        },
        {
            "name": "Feylost",
            "desc": "You grew up in the Feywild after disappearing from your home plane as a child. Perhaps you were spirited away by kindly Fey who thought you were destined for great things. Perhaps you stumbled through a Fey crossing by chance during a twilight stroll in the woods. Perhaps you were kidnapped by evil Fey but escaped from their clutches. Whatever the manner of your disappearance, you gradually fell under the Feywild's spell and learned a little about the nature of the mercurial tricksters that dwell there.\n\nWhen you finally returned to your home plane, you did not come back unchanged. You are haunted by the fact the Feywild-a mirror world hidden behind a mere twist of perception-is only a hair's breadth away. Although your memories of the Feywild grow fainter with each passing day, your heart swells with a mixture of fear and joy at the prospect of one day venturing back to the Plane of Faerie-your home away from home.",
            "features": [
                {
                    "name" : "Fey Mark",
                    "desc" : "You were transformed in some small way by your stay in the Feywild and gained a fey mark, determined by rolling on the Fey Mark table.",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "Your eyes swirl with iridescent colors."
                        },
                        {
                            "name" : "You have a sweet scent, like that of nectar or honey."
                        },
                        {
                            "name" : "You have long whiskers like those of a cat."
                        },
                        {
                            "name" : "Your ears are covered with soft tufts of fur."
                        },
                        {
                            "name" : "Your skin sparkles in moonlight."
                        },
                        {
                            "name" :"Flowers either bloom or wilt (your choice) in your presence."
                        },
                        {
                            "name" : "Your hair is made of vines or brambles and grows back to normal length within 1 hour of being cut."
                        },
                        {
                            "name" : "You have a tail like that of a dog or another animal."
                        }
                    ]
                },
                {
                    "name" :"Feywild Visitor",
                    "desc" : "Whenever you're sound asleep or in a deep trance during a long rest, a spirit of the Feywild might pay you a visit, if the DM wishes it. Determine the spirit's form by rolling on the Feywild Visitor table. No harm ever comes to you as a result of such visits, which can last for minutes or hours, and you remember each visit when you wake up. Conversations that occur with a visitor can contain any number of things, from messages and insights to nonsense and red herrings, at the DM's discretion. Such conversations are always conducted in a language you can understand, even if the Feywild visitor can't speaking that language normally.",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "Awakened creature (a Beast or an ordinary plant that has had the Awaken spell cast on it)"
                        },
                        {
                            "name" : "Centaur"
                        },
                        {
                            "name" : "Dryad"
                        },
                        {
                            "name" : "Faerie Dragon"
                        },
                        {
                            "name" : "Pixie"
                        },
                        {
                            "name" : "Satyr"
                        },
                        {
                            "name" : "Sprite"
                        },
                        {
                            "name" : "Unicorn"
                        }
                    ]
                },
                {
                    "name" : "Feywild Connection",
                    "desc" : "Your mannerisms and knowledge of fey customs are recognized by natives of the Feywild, who see you as one of their own. Because of this, friendly Fey creatures are inclined to come to your aid if you are lost or need help in the Feywild."
                }
            ],
            "equipment": [
                {
                    "name" : "A musical instrument of your choice",
                    "choose" : 1,
                    "from" : [
                        {
                            "index" : "musical_instruments"
                        }
                    ]
                },
                {
                    "name" : "Travlers clothes"
                },
                {
                    "name" : "three trinkets (each determind by rolling on the Feywild Trinkets table",
                    "comment" : "TODO"
                },
                {
                    "name" : "A pouch containing 8gp",
                    "index" : "gold",
                    "amount" : 8
                }
            ],
            "proficiencies": [
                {
                    "name" : "Deception"
                },
                {
                    "name" : "Survival"
                },
                {
                    "name" : "One type of musical instrument",
                    "choose" : 1,
                    "from" : [
                        {
                            "index" : "musical_instruments"
                        }
                    ]
                }
            ],
            "languages": [
                {
                    "name" : "One of your choice of Elvish, Gnomish, Goblin, or Sylvan.",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "Elvish"
                        },
                        {
                            "name" : "Gnomish"
                        },
                        {
                            "name" : "Goblin"
                        },
                        {
                            "name" : "Sylvan"
                        }
                    ]
                }
            ]
        },
        {
            "name": "Fisher",
            "desc": "You have spent your life aboard fishing vessels or combing the shallows for the bounty of the ocean. Perhaps you were born into a family of fisher folk, working with your kin to feed your village. Maybe the job was a means to an end - a way out of an undesirable circumstance that forced you to take up life aboard a ship. Regardless of how you began, you soon fell in love with the sea, the art of fishing, and the promise of the eternal horizon.",
            "features": [
                {
                    "name" : "Harvest the Water",
                    "desc" : "You gain advantage on ability checks made using fishing tackle. If you have access to a body of water that sustains marine life, you can maintain a moderate lifestyle while working as a fisher, and you can catch enough food to feed yourself and up to ten other people each day."
                },
                {
                    "name" :"Fishing Tale",
                    "desc" : "You can tell a compelling tale, whether tall or true, to impress and entertain others. Once a day, you can tell your story to willing listeners. At the DM's discretion, a number of those listeners become friendly toward you; this is not a magical effect, and continued amicability on their part depends on your actions. You can roll on the following table to help determine the theme of your tale or choose one that best fits your character. Alternatively, work with your DM to create your own fishing tale.",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "Lobster Wrestling",
                            "desc" : "You fought in hand-to-hand combat with an immense lobster."
                        },
                        {
                            "name" : "It Dragged the Boat",
                            "desc" : "You nearly caught a fish of monstrous size that pulled your boat for miles."
                        },
                        {
                            "name" : "Fins of Pure Gold",
                            "desc" : "You caught a sea animal whose fins were made of pure gold, but another fisher stole it."
                        },
                        {
                            "name" : "Ghost Fish",
                            "desc" : "You are haunted by a ghostly fish that only you can see."
                        },
                        {
                            "name" : "Nemesis Clam",
                            "desc" : "A large clam containing a pearl the size of your head claimed one of your fingers before jetting away; one day, you'll find that clam."
                        },
                        {
                            "name" : "It Swallowed the Sun",
                            "desc" : "You once saw a fish leap from the water and turn day into night."
                        },
                        {
                            "name" : "Dive into the Abyss",
                            "desc" : "You found yourself in an underwater cave leading to the Abyss, and your luck has been sour ever since."
                        },
                        {
                            "name" : "Love Story",
                            "desc" : "You fell in love with a creature of pure water, but your brief romance ended tragically."
                        }
                    ]
                }
            ],
            "equipment": [
                {
                    "name" : "Fishing tackle"
                },
                {
                    "name" : "A favorite fishing lure or oiled leather wading boots",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "Fishing lure"
                        },
                        {
                            "name" : "Oiled leather wading boots"
                        }
                    ]
                },
                {
                    "name" : "Traveler's clothes"
                },
                {
                    "name" : "a belt pouch containing 10 gp",
                    "index" : "gold",
                    "amount" : 10
                }
            ],
            "proficiencies": [
                {
                    "name" : "History"
                },
                {
                    "name" : "Survival"
                }
            ],
            "languages": [
                {
                    "name" : "One language of your choice",
                    "choose" : 1,
                    "from" : [
                        {
                            "index" : "all_languages"
                        }
                    ]
                }
            ]
        },
        {
            "name": "Folk Hero",
            "desc": "You come from a humble social rank, but you are destined for so much more. Already the people of your home village regard you as their champion, and your destiny calls you to stand against the tyrants and monsters that threaten the common folk everywhere.",
            "features": [
                {
                    "name" : "Defining Event",
                    "desc" : "You previously pursued a simple profession among the peasantry, perhaps as a farmer, miner, servant, shepherd, woodcutter, or gravedigger. But something happened that set you on a different path and marked you for greater things. Choose or randomly determine a defining event that marked you as a hero of the people.",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "I stood up to a tyrant's agents."
                        },
                        {
                            "name" : "I saved people during a natural disaster."
                        },
                        {
                            "name" : "I stood alone against a terrible monster."
                        },
                        {
                            "name" : "I stole from a corrupt merchant to help the poor."
                        },
                        {
                            "name" : "I led a militia to fight off an invading army."
                        },
                        {
                            "name" : "I broke into a tyrant's castle and stole weapons to arm the people."
                        },
                        {
                            "name" : "I trained the peasantry to use farm implements as weapons against a tyrant's soldiers."
                        },
                        {
                            "name" : "A lord rescinded an unpopular decree after I led a symbolic act of protect against it."
                        },
                        {
                            "name" : "A celestial, fey, or similar creature gave me a blessing or revealed my secret origin."
                        },
                        {
                            "name" : "Recruited into a lord's army, I rose to leadership and was commended for my heroism."
                        }
                    ]
                },
                {
                    "name" : "Rustic Hospitality",
                    "desc" : "Since you come from the ranks of the common folk, you fit in among them with ease. You can find a place to hide, rest, or recuperate among other commoners, unless you have shown yourself to be a danger to them. They will shield you from the law or anyone else searching for you, though they will not risk their lives for you."
                }
            ],
            "equipment": [
                {
                    "name" : "A set of artisan's tools of your choice",
                    "choose" : 1,
                    "from" : [
                        {
                            "index" : "artisans_tools"
                        }
                    ]
                },
                {
                    "name" : "A shovel"
                },
                {
                    "name" : "An iron pot"
                },
                {
                    "name" : "Common cloths"
                },
                {
                    "name" : "A pouch containing 10gp",
                    "index" : "gold",
                    "amount" : 10
                }
            ],
            "proficiencies": [
                {
                    "name" : "Animal Handling"
                },
                {
                    "name" : "Survival"
                },
                {
                    "name" : "Proficiency with one type of artisans tools",
                    "choose" : 1,
                    "from" : [
                        {
                            "index" : "artisans_tools"
                        }
                    ]
                },
                {
                    "name" : "Vehicles (Land)"
                }
            ],
            "languages": [
            ]
        },
        {
            "name": "Guild Artisan",
            "desc": "You are a member of an artisan's guild, skilled in a particular field and closely associated with other artisans. You are a well-established part of the mercantile world, freed by talent and wealth from the constraints of a feudal social order. You learned your skills as an apprentice to a master artisan, under the sponsorship of your guild, until you became a master in your own right.",
            "features": [
                {
                    "name" : "Guild Business",
                    "desc" : "As a member of your guild, you know the skills needed to create finished items from raw materials (reflected in your proficiency with a certain kind of artisan's tools), as well as the principles of trade and good business practices. The question now is whether you abandon your trade for adventure, or take on the extra effort to weave adventuring and trade together.",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "Alchemists and apothecaries"
                        },
                        {
                            "name" : "Armorers, locksmiths, and finesmiths"
                        },
                        {
                            "name" : "Brewers, distillers, and vintners"
                        },
                        {
                            "name" : "Calligraphers, scribes, and scriveners"
                        },
                        {
                            "name" : "Carpenters, roofers, and plasterers"
                        },
                        {
                            "name" : "Cartographers, surveyors, and chart-makers"
                        },
                        {
                            "name" : "Cobblers and shoemakers"
                        },
                        {
                            "name" : "Cooks and bakers"
                        },
                        {
                            "name" : "Glassblowers and glaziers"
                        },
                        {
                            "name" : "Jewelers and gemcutters"
                        },
                        {
                            "name" : "Leatherworkers, skinners, and tanners"
                        },
                        {
                            "name" : "Masons and stonecutters"
                        },
                        {
                            "name" : "Painters, limners, and sign-makers"
                        },
                        {
                            "name" : "Potters and tile-makers,"
                        },
                        {
                            "name" : "Shipwrights and sailmakers"
                        },
                        {
                            "name" : "Smiths and metal-forgers"
                        },
                        {
                            "name" : "Tinkers, pewterers, and casters"
                        },
                        {
                            "name" : "Wagon-makers and wheelwrights"
                        },
                        {
                            "name" : "Weavers and dyers"
                        },
                        {
                            "name" : "Woodcarvers, coopers, and bowyers"
                        }
                    ]
                },
                {
                    "name" : "Guild Membership",
                    "desc" : "As an established and respected member of a guild, you can rely on certain benefits that membership provides. Your fellow guild members will provide you with lodging and food if necessary, and pay for your funeral if needed. In some cities and towns, a guildhall offers a central place to meet other members of your profession, which can be a good place to meet potential patrons, allies, or hirelings.\n\nGuilds often wield tremendous political power. If you are accused of a crime, your guild will support you if a good case can be made for your innocence or the crime is justifiable. You can also gain access to powerful political figures through the guild, if you are a member in good standing. Such connections might require the donation of money or magic items to the guild's coffers.\n\nYou must pay dues of 5 gp per month to the guild. If you miss payments, you must make up back dues to remain in the guild's good graces."
                }
            ],
            "equipment": [
                {
                    "name" : "A set of artisan's tools.",
                    "choose" : 1,
                    "from" : [
                        {
                            "index" : "artisans_tools"
                        }
                    ]
                },
                {
                    "name" : "a letter of introduction from your guild"
                },
                {
                    "name" : "Traveler's clothes"
                },
                {
                    "name" : "a pouch containing 15 gp",
                    "index" : "gold",
                    "amount" : 15
                }
            ],
            "proficiencies": [
                {
                    "name" : "Insight"
                },
                {
                    "name" : "Persuasion"
                },
                {
                    "name" : "Proficiency with one type of artisan's tools",
                    "choose" : 1,
                    "from" : [
                        {
                            "index" : "artisans_tools"
                        }
                    ]
                }
            ],
            "languages": [
                {
                    "name": "One language of your choice.",
                    "choose" : 1,
                    "from" : [
                        {
                            "index" : "all_languages"
                        }
                    ]
                }
            ]
        },
        {
            "name": "Haunted One",
            "desc": "You are haunted by something so terrible that you dare not speak of it. You’ve tried to bury it and run away from it, to no avail. Whatever this thing is that haunts you can’t be slain with a sword or banished with a spell. It might come to you as a shadow on the wall, a bloodcurdling nightmare, a memory that refuses to die, or a demonic whisper in the dark. The burden has taken its toll, isolating you from most people and making you question your sanity. You must find a way to overcome it before it destroys you.",
            "features": [
                {
                    "name" : "Harrowing Event",
                    "choose" : 1,
                    "desc" : "Prior to becoming an adventurer, your path in life was defined by one dark moment, one fateful decision, or one tragedy. Now you feel a darkness threatening to consume you, and you fear there may be no hope of escape. Choose a harrowing event that haunts you, or roll one on the Harrowing Events table.",
                    "from" : [
                        {
                            "name" : "A monster that slaughtered dozens of innocent people spared your life, and you don’t know why."
                        },
                        {
                            "name" : "You were born under a dark star. You can feel it watching you, coldly and distantly. Sometimes it beckons you in the dead of night."
                        },
                        {
                            "name" : "An apparition that has haunted your family for generations now haunts you. You don’t know what it wants, and it won’t leave you alone."
                        },
                        {
                            "name" : "Your family has a history of practicing the dark arts. You dabbled once and felt something horrible clutch at your soul, whereupon you fled in terror."
                        },
                        {
                            "name" : "An oni took your sibling one cold, dark night, and you were unable to stop it."
                        },
                        {
                            "name" : "You were cursed with lycanthropy and later cured. You are now haunted by the innocents you slaughtered."
                        },
                        {
                            "name" : "A hag kidnapped and raised you. You escaped, but the hag still has a magical hold over you and fills your mind with evil thoughts."
                        },
                        {
                            "name" : "You opened an eldritch tome and saw things unfit for a sane mind. You burned the book, but its words and images are burned into your psyche."
                        },
                        {
                            "name" : "A fiend possessed you as a child. You were locked away but escaped. The fiend is still inside you, but now you try to keep it locked away."
                        },
                        {
                            "name" : "You did terrible things to avenge the murder of someone you loved. You became a monster, and it haunts your waking dreams."
                        }
                    ]
                },
                {
                    "name" : "Heart of Darkness",
                    "desc" : "Those who look into your eyes can see that you have faced unimaginable horror and that you are no stranger to darkness. Though they might fear you, commoners will extend you every courtesy and do their utmost to help you. Unless you have shown yourself to be a danger to them, they will even take up arms to fight alongside you, should you find yourself facing an enemy alone."
                }
            ],
            "equipment": [
                {
                    "index" : "Monster Hunter's Pack"
                },
                {
                    "name" : "One trinket of special significance"
                },
                {
                    "name" : "A set of common clothes"
                },
                {
                    "name" : "1 sp",
                    "index" : "silver",
                    "amount" : 1
                }
            ],
            "proficiencies": [
                {
                    "name" : "Choose two of Arcana, Investigation, Religion, or Survival",
                    "choose" : 2,
                    "from" : [
                        {
                            "name" : "Arcana"
                        },
                        {
                            "name" : "Investigation"
                        },
                        {
                            "name" : "Religion"
                        },
                        {
                            "name" : "Survival"
                        }
                    ]
                }
            ],
            "languages": [
                {
                    "name" : "One language of your choice",
                    "choose" : 1,
                    "from" : [
                        {
                            "index" : "all_languages"
                        }
                    ]
                },
                {
                    "name" : "One exotic language of your choice",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "Abyssal"
                        },
                        {
                            "name" : "Celestial"
                        },
                        {
                            "name" : "Deep Speech"
                        },
                        {
                            "name" : "Draconic"
                        },
                        {
                            "name" : "Infernal"
                        },
                        {
                            "name" : "Primordial"
                        },
                        {
                            "name" : "Sylvan"
                        },
                        {
                            "name" : "Undercommon"
                        }
                    ]
                }
            ]
        },
        {
            "name": "Hermit",
            "desc": "You lived in seclusion – either in a sheltered community such as a monastery, or entirely alone – for a formative part of your life. In your time apart from the clamor of society, you found quiet, solitude, and perhaps some of the answers you were looking for.",
            "features": [
                {
                    "name" : "Life of Seclusion",
                    "desc" : "What was the reason for your isolation, and what changed to allow you to end your solitude? You can work with your DM to determine the exact nature of your seclusion, or you can choose to roll on the table below to determine the reason behind your seclusion.",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "I was searching for spiritual enlightenment."
                        },
                        {
                            "name" : "I was partaking of communal living in accordance with the dictates of a religious order."
                        },
                        {
                            "name" : "I was exiled for a crime I didn't commit."
                        },
                        {
                            "name" : "I retreated from society after a life-altering event."
                        },
                        {
                            "name" : "I needed a quiet place to work on my art, literature, music, or manifesto."
                        },
                        {
                            "name" : "I needed to commune with nature, far from civilization."
                        },
                        {
                            "name" : "I was the caretaker of an ancient ruin or relic."
                        },
                        {
                            "name" : "tI was a pilgrim in search of a person, place, or relic of spiritual significance."
                        }
                    ]
                },
                {
                    "name" : "Discovery",
                    "desc" : "The quiet seclusion of your extended hermitage gave you access to a unique and powerful discovery. The exact nature of this revelation depends on the nature of your seclusion. It might be a great truth about the cosmos, the deities, the powerful beings of the outer planes, or the forces of nature. It could be a site that no one else has ever seen. You might have uncovered a fact that has long been forgotten, or unearthed some relic of the past that could rewrite history. It might be information that would be damaging to the people who or consigned you to exile, and hence the reason for your return to society.\n\nWork with your DM to determine the details of your discovery and its impact on the campaign."
                }
            ],
            "equipment": [
                {
                    "name" : "A scroll case stuffed full of notes from your studies or prayers"
                },
                {
                    "name" : "A winter blanked"
                },
                {
                    "index" : "Common clothes"
                },
                {
                    "index" : "Herbalism kit"
                },
                {
                    "name" : "5 gp",
                    "index": "gold",
                    "amount" : 5
                }
            ],
            "proficiencies": [
                {
                    "name" : "Medicine"
                },
                {
                    "name" : "Religion"
                }
            ],
            "languages": [
                {
                    "name" : "One language of your choice",
                    "choose" : 1,
                    "from" : [
                        {
                            "index" : "all_languages"
                        }
                    ]
                }
            ]
        },
        {
            "name": "Inheritor",
            "desc": "You are the heir to something of great value – not mere coin or wealth, but an object that has been entrusted to you and you alone. Your inheritance might have come directly to you from a member of your family, by right of birth, or it could have been left to you by a friend, a mentor, a teacher, or someone else important in your life. The revelation of your inheritance changed your life, and might have set you on the path to adventure, but it could also come with many dangers, including those who covet your gift and want to take it from you – by force, if need be.",
            "features": [
                {
                    "name" : "Inheritance",
                    "desc" : "Choose or randomly determine your inheritance from among the possibilities in the table below. Work with your DM to come up with details: Why is your inheritance so important, and what is its full story? You might prefer for the DM to invent these details as part of the game, allowing you to learn more about your inheritance as your character does.\n\nThe DM is free to use your inheritance as a story hook, sending you on quests to learn more about its history or true nature, or confronting you with foes who want to claim it for themselves or prevent you from learning what you seek. The DM also determines the properties of your inheritance and how they figure into the item's history and importance. For instance, the object might be a minor magic item, or one that begins with a modest ability and increases in potency with the passage of time. Or, the true nature of your inheritance might not be apparent at first and is revealed only when certain conditions are met.\n\nWhen you begin your adventuring career, you can decide whether to tell your companions about your inheritance right away. Rather than attracting attention to yourself, you might want to keep your inheritance a secret until you learn more about what it means to you and what it can do for you.",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "A document such as a map, a letter, or a journal"
                        },
                        {
                            "name" : "A trinket"
                        },
                        {
                            "name" : "An article of clothing"
                        },
                        {
                            "name" : "A piece of jewelry"
                        },
                        {
                            "name" : "An arcane book or formulary"
                        },
                        {
                            "name" : "A written story, song, poem, or secret"
                        },
                        {
                            "name" : "A tattoo or other body marking"
                        }
                    ]
                }
            ],
            "equipment": [
            ],
            "proficiencies": [
                {
                    "name" : "Survival"
                },
                {
                    "name" : "Proficiency in Arcana, History, or Religion",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "Arcana"
                        },
                        {
                            "name" : "History"
                        },
                        {
                            "name" : "Religion"
                        }
                    ]
                },
                {
                    "name" : "Proficiency in a gaming set of musical instrument",
                    "choose" : 1,
                    "from" : [
                        {
                            "index" : "gaming_sets"
                        },
                        {
                            "index" : "musical_instruments"
                        }
                    ]
                }
            ],
            "languages": [
                {
                    "name" : "Any language of your choice",
                    "choose" : 1,
                    "from" : [
                        {
                            "index" : "all_languages"
                        }
                    ]
                }
            ]
        },
        {
            "name": "Knight",
            "desc": "You understand wealth, power, and privilege. You carry a noble title, and your family owns land, collects taxes, and wields significant political influence. You might be a pampered aristocrat unfamiliar with work or discomfort, a former merchant just elevated to the nobility, or a disinherited scoundrel with a disproportionate sense of entitlement. Or you could be an honest, hard-working landowner who cares deeply about the people who live and work on your land, keenly aware of your responsibility to them.\n\nWork with your DM to come up with an appropriate title and determine how much authority that title carries. A noble title doesn't stand on its own-it's connected to an entire family, and whatever title you hold, you will pass it down to your own children. Not only do you need to determine your noble title, but you should also work with the DM to describe your family and their influence on you.\n\nIs your family old and established, or was your title only recently bestowed? How much influence do they wield, and over what area? What kind of reputation does your family have among the other aristocrats of the region? How do the common people regard them?\n\nWhat's your position in the family? Are you the heir to the head of the family? Have you already inherited the title? How do you feel about that responsibility? Or are you so far down the line of inheritance that no one cares what you do, as long as you don't embarrass the family? How does the head of your family feel about your adventuring career? Are you in your family's good graces, or shunned by the rest of your family?\n\nDoes your family have a coat of arms? An insignia you might wear on a signet ring? Particular colors you wear all the time? An animal you regard as a symbol of your line or even a spiritual member of the family?\n\nThese details help establish your family and your title as features of the world of the campaign.",
            "features": [
                {
                    "name" : "Position of Privilege",
                    "desc" : "Thanks to your noble birth, people are inclined to think the best of you. You are welcome in high society, and people assume you have the right to be wherever you are. The common folk make every effort to accommodate you and avoid your displeasure, and other people of high birth treat you as a member of the same social sphere. You can secure an audience with a local noble if you need to."
                }
            ],
            "equipment": [
                {
                    "index" : "fine clothes"
                },
                {
                    "index" : "Signet Ring"
                },
                {
                    "name" : "A scroll of pedigree"
                },
                {
                    "name" : "A purse containing 25gp",
                    "index" : "gold",
                    "amount" : 25
                }
            ],
            "proficiencies": [
                {
                    "name" : "History"
                },
                {
                    "name" : "Persuasion"
                },
                {
                    "name" : "Proficiency with one type of gaming set",
                    "choose" : 1,
                    "from" :[
                        {
                            "index" : "gaming_sets"
                        }
                    ]
                }
            ],
            "languages": [
                {
                    "name" : "One language of your choice",
                    "choose" : 1,
                    "from" : [
                        {
                            "index" : "all_languages"
                        }
                    ]
                }
            ]
        }
    ]
}
