{
    "classes": [
        {
            "name": "Artificer",
            "spell_casting": {
                "type": 0.5,
                "casting_ability": "Int",
                "prepare_from": "all",
                "preparation_mod_multiplier": 0.5,
                "cantrips_known": [
                    2,
                    2,
                    2,
                    2,
                    2,
                    2,
                    2,
                    2,
                    2,
                    3,
                    3,
                    3,
                    3,
                    4,
                    4,
                    4,
                    4,
                    4,
                    4,
                    4
                ],
                "spell_slots": [
                    [
                        2
                    ],
                    [
                        2
                    ],
                    [
                        3
                    ],
                    [
                        3
                    ],
                    [
                        4,
                        2
                    ],
                    [
                        4,
                        2
                    ],
                    [
                        4,
                        3
                    ],
                    [
                        4,
                        3
                    ],
                    [
                        4,
                        3,
                        2
                    ],
                    [
                        4,
                        3,
                        2
                    ],
                    [
                        4,
                        3,
                        3
                    ],
                    [
                        4,
                        3,
                        3
                    ],
                    [
                        4,
                        3,
                        3,
                        1
                    ],
                    [
                        4,
                        3,
                        3,
                        1
                    ],
                    [
                        4,
                        3,
                        3,
                        2
                    ],
                    [
                        4,
                        3,
                        3,
                        2
                    ],
                    [
                        4,
                        3,
                        3,
                        3
                    ],
                    [
                        4,
                        3,
                        3,
                        3,
                        1
                    ],
                    [
                        4,
                        3,
                        3,
                        3,
                        1
                    ],
                    [
                        4,
                        3,
                        3,
                        3,
                        2
                    ],
                    [
                        4,
                        3,
                        3,
                        3,
                        2
                    ]
                ]
            },
            "starting_gold_d4s" : 4,
            "hit_die": 8,
            "subclass_level": 3,
            "proficiency_choices": [
                {
                    "name": "Choose two from Arcana, History, Investigation, Medicine, Nature, Perception, Sleight of Hand",
                    "choose": 2,
                    "from": [
                        {
                            "name": "Arcana"
                        },
                        {
                            "name": "History"
                        },
                        {
                            "name": "Investigation"
                        },
                        {
                            "name": "Medicine"
                        },
                        {
                            "name": "Nature"
                        },
                        {
                            "name": "Perception"
                        },
                        {
                            "name": "Sleight of Hand"
                        }
                    ]
                },
                {
                    "name": "One type of artisan’s tools of your choice",
                    "choose": 1,
                    "from": [
                        {
                            "index": "artisans tools"
                        }
                    ]
                }
            ],
            "proficiencies": [
                {
                    "name": "Simple weapons"
                },
                {
                    "name": "Light armor"
                },
                {
                    "name": "Medium armor"
                },
                {
                    "name": "Shields"
                },
                {
                    "name": "Thieves tools"
                },
                {
                    "name": "Tinkers tools"
                },
                {
                    "name": "Saving throw (Constitution)"
                },
                {
                    "name": "Saving throw (Intelligence)"
                }
            ],
            "features": [
                {
                    "name": "Magical Tinkering",
                    "desc": "At 1st level, you've learned how to invest a spark of magic into mundane objects. To use this ability, you must have thieves' tools or artisan's tools in hand. You then touch a Tiny nonmagical object as an action and give it one of the following magical properties of your choice: The object sheds bright light in a 5-foot radius and dim light for an additional 5 feet. Whenever tapped by a creature, the object emits a recorded message that can be heard up to 10 feet away. You utter the message when you bestow this property on the object, and the recording can be no more than 6 seconds long. The object continuously emits your choice of an odor or a nonverbal sound (wind, waves, chirping, or the like). The chosen phenomenon is perceivable up to 10 feet away. A static visual effect appears on one of the object's surfaces. This effect can be a picture, up to 25 words of text, lines and shapes, or a mixture of these elements, as you like. The chosen property lasts indefinitely. As an action, you can touch the object and end the property early. You can bestow magic on multiple objects, touching one object each time you use this feature, though a single object can only bear one property at a time. The maximum number of objects you can affect with this feature at one time is equal to your Intelligence modifier (minimum of one object). If you try to exceed your maximum, the oldest property immediately ends, and then the new property applies.",
                    "level": 1
                },
                {
                    "name" : "Infuse item",
                    "level" : 2,
                    "desc" : "When you gain this feature, pick four artificer infusions to learn. You learn additional infusions of your choice when you reach certain levels in this class, as shown in the Infusions Known column of the Artificer table.\n\nWhenever you gain a level in this class, you can replace one of the artificer infusions you learned with a new one.",
                    "choose" : [
                        0, 4, 4, 4, 4, 6, 6, 6, 6, 8, 8, 8, 8, 10, 10, 10, 10, 12, 12, 12
                    ],
                    "max_active" :  [
                        0, 2, 2, 2, 2, 3, 3, 3, 3, 4, 4, 4, 4, 5, 5, 5, 5, 6, 6, 6
                    ],
                    "from" : [
                        {
                            "index" : "infusions"
                        }
                    ]
                },
                {
                    "name": "The Right Tool for the Job",
                    "desc": "At 3rd level, you've learned how to produce exactly the tool you need: with thieves' tools or artisan's tools in hand, you can magically create one set of artisan's tools in an unoccupied space within 5 feet of you. This creation requires 1 hour of uninterrupted work, which can coincide with a short or long rest. Though the product of magic, the tools are nonmagical, and they vanish when you use this feature again.",
                    "level": 3
                },
                {
                    "name": "Tool Expertise",
                    "desc": "At 6th level, your proficiency bonus is now doubled for any ability check you make that uses your proficiency with a tool.",
                    "level": 6
                },
                {
                    "name": "Flash of Genius",
                    "desc": "At 7th level, you've gained the ability to come up with solutions under pressure. When you or another creature you can see within 30 feet of you makes an ability check or a saving throw, you can use your reaction to add your Intelligence modifier to the roll. You can use this feature a number of times equal to your Intelligence modifier (minimum of once). You regain all expended uses when you finish a long rest.",
                    "level": 7
                },
                {
                    "name": "Magic Item Adept",
                    "desc": "When you reach 10th level, you achieve a profound understanding of how to use and make magic items: You can attune to up to four magic items at once. If you craft a magic item with a rarity of common or uncommon, it takes you a quarter of the normal time, and it costs you half as much of the usual gold. ",
                    "level": 10
                },
                {
                    "name": "Spell-Storing Item",
                    "desc": "At 11th level, you can now store a spell in an object. Whenever you finish a long rest, you can touch one simple or martial weapon or one item that you can use as a spellcasting focus, and you store a spell in it, choosing a lst- or 2nd-level spell from the artificer spell list that requires 1 action to cast (you needn't have it prepared). While holding the object, a creature can take an action to produce the spell's effect from it, using your spellcasting ability modifier. If the spell requires concentration, the creature must concentrate. The spell stays in the object until it's been used a number of times equal to twice your Intelligence modifier (minimum of twice) or until you use this feature again to store a spell in an object.",
                    "level": 11
                },
                {
                    "name": "Magic Item Savant",
                    "desc": "At 14th level, your skill with magic items deepens more: You can attune to up to five magic items at once. You ignore all class, race, spell and level requirements on attuning to or using a magic item.",
                    "level": 14
                },
                {
                    "name": "Magic Item Master",
                    "desc": "At 14th level, your skill with magic items deepens more: You can attune to up to five magic items at once. You ignore all class, race, spell and level requirements on attuning to or using a magic item.",
                    "level": 18
                },
                {
                    "name": "Soul of Artifice",
                    "desc": "At 20th level, you develop a mystical connection to your magic items, which you can draw on for protection: You gain a +1 bonus to all saving throws per magic item you are currently attuned to. If you're reduced to 0 hit points but not killed out-right, you can use your reaction to end one of your artificer infusions, causing you to drop to 1 hit point instead of 0.",
                    "level": 20
                }
            ],
            "equipment": [
                {
                    "name": "any two simple weapons",
                    "choose": 2,
                    "from": [
                        {
                            "index": "simple_weapons"
                        }
                    ]
                }
            ],
            "subclasses": [
                {
                    "name": "Alchemist",
                    "features": [
                        {
                            "name": "Tool Proficiency",
                            "desc": "You gain proficiency with alchemist’s supplies. If you already have this proficiency, you gain proficiency with one other type of artisan’s tools of your choice.",
                            "choose": 1,
                            "from": [
                                {
                                    "name": "Artisans Tools",
                                    "index": "artisans_tools",
                                    "desc": "TODO",
                                    "comment": "TODO make sure this checks if you have Alchemists tools first before offering the choose option"
                                }
                            ]
                        },
                        {
                            "level": 3,
                            "name": "Experimental Elixir",
                            "desc": "Whenever you finish a long rest, you can magically produce an experimental elixir in an empty flask you touch. Roll on the Experimental Elixir table for the elixir’s effect, which is triggered when someone drinks the elixir. As an action, a creature can drink the elixir or administer it to an incapacitated creature. You can create additional experimental elixirs by expending a spell slot of 1st level or higher for each one. When you do so, you use your action to create the elixir in an empty flask you touch, and you choose the elixir’s effect from the Experimental Elixir table. Creating an experimental elixir requires you to have alchemist’s supplies on your person, and any elixir you create with this feature lasts until it is drunk or until the end of your next long rest. When you reach certain levels in this class, you can make more elixirs at the end of a long rest: two at 6th level and three at 15th level. Roll for each elixir’s effect separately. Each elixir requires its own flask. 1, Healing. The drinker regains a number of hit points equal to 2d4 + your Intelligence modifier. 2, Swiftness. The drinker’s walking speed increases by 10 feet for 1 hour. 3, Resilience. The drinker gains a +1 bonus to AC for 10 minutes. 4, Boldness. The drinker can roll a d4 and add the number rolled to every attack roll and saving throw they make for the next minute. 5, Flight. The drinker gains a flying speed of 10 feet for 10 minutes. 6, Transformation. The drinker’s body is transformed as if by the alter self spell. The drinker determines the transformation caused by the spell, the effects of which last for 10 minutes."
                        },
                        {
                            "level": 5,
                            "name": "Alchemical Savant",
                            "desc": "You've developed masterful command of magical chemicals, enhancing the healing and damage you create through them. Whenever you cast a spell using your alchemist’s supplies as the spellcasting focus, you gain a bonus to one roll of the spell. That roll must restore hit points or be a damage roll that deals acid, fire, necrotic, or poison damage, and the bonus equals your Intelligence modifier (minimum of +1)."
                        },
                        {
                            "level": 9,
                            "name": "Restorative Reagents",
                            "desc": "You can incorporate restorative reagents into some of your works: Whenever a creature drinks an experimental elixir you created, the creature gains temporary hit points equal to 2d6 + your Intelligence modifier (minimum of 1 temporary hit point). You can cast lesser restoration without expending a spell slot and without preparing the spell, provided you use alchemist’s supplies as the spellcasting focus. You can do so a number of times equal to your Intelligence modifier (minimum of once), and you regain all expended uses when you finish a long rest."
                        },
                        {
                            "level": 15,
                            "name": "Chemical Mastery",
                            "desc": "You have been exposed to so many chemicals that they pose little risk to you, and you can use them to quickly end certain ailments: You gain resistance to acid damage and poison damage, and you are immune to the poisoned condition. You can cast greater restoration and heal without expending a spell slot, without preparing the spell, and without material components, provided you use alchemist’s supplies as the spellcasting focus. Once you cast either spell with this feature, you can’t cast that spell with it again until you finish a long rest."
                        }
                    ],
                    "spells": [
                        {
                            "level": 3,
                            "name": "healing word",
                            "index": "healing_word"
                        },
                        {
                            "level": 3,
                            "name": "ray of sickness",
                            "index": "ray_of_sickness"
                        },
                        {
                            "level": 5,
                            "name": "flaming sphere",
                            "index": "flaming_sphere"
                        },
                        {
                            "level": 5,
                            "name": "Melf’s acid arrow",
                            "index": "Melf’s_acid_arrow"
                        },
                        {
                            "level": 9,
                            "name": "gaseous form",
                            "index": "gaseous_form"
                        },
                        {
                            "level": 9,
                            "name": "mass healing word",
                            "index": "mass_healing_word"
                        },
                        {
                            "level": 13,
                            "name": "blight",
                            "index": "blight"
                        },
                        {
                            "level": 17,
                            "name": "cloudkill",
                            "index": "cloudkill"
                        },
                        {
                            "level": 3,
                            "name": "raise dead",
                            "index": "raise_dead"
                        }
                    ]
                },
                {
                    "name": "Armorer",
                    "features": [
                        {
                            "level": 3,
                            "name": "Tools of the Trade",
                            "desc": "You gain proficiency with heavy armor. You also gain proficiency with smith’s tools. If you already have this tool proficiency, you gain proficiency with one other type of artisan’s tools of your choice.",
                            "choose": 1,
                            "from": [
                                {
                                    "name": "Artisans Tools",
                                    "index": "artisans_tools",
                                    "desc": "TODO",
                                    "comment": "TODO make sure this checks if you have Alchemists tools first before offering the choose option"
                                }
                            ]
                        },
                        {
                            "level": 3,
                            "name": "Arcane Armor",
                            "desc": "Your metallurgical pursuits have led to you making armor a conduit for your magic. As an action, you can turn a suit of armor you are wearing into Arcane Armor, provided you have smith’s tools in hand. You gain the following benefits while wearing this armor: If the armor normally has a Strength requirement, the arcane armor lacks this requirement for you. You can use the arcane armor as a spellcasting focus for your artificer spells. The armor attaches to you and can’t be removed against your will. It also expands to cover your entire body, although you can retract or deploy the helmet as a bonus action. The armor replaces any missing limbs, functioning identically to a limb it replaces. You can doff or don the armor as an action. The armor continues to be Arcane Armor until you don another suit of armor or you die."
                        },
                        {
                            "level": 3,
                            "name": "Armor Model",
                            "desc": "You can customize your Arcane Armor. When you do so, choose one of the following armor models: Guardian or Infiltrator. The model you choose gives you special benefits while you wear it. Each model includes a special weapon. When you attack with that weapon, you can add your Intelligence modifier, instead of Strength or Dexterity, to the attack and damage rolls. You can change the armor’s model whenever you finish a short or long rest, provided you have smith’s tools in hand. Guardian) You design your armor to be in the front line of conflict. It has the following features: Thunder Gauntlets. Each of the armor’s gauntlets counts as a simple melee weapon while you aren’t holding anything in it, and it deals 1d8 thunder damage on a hit. A creature hit by the gauntlet has disadvantage on attack rolls against targets other than you until the start of your next turn, as the armor magically emits a distracting pulse when the creature attacks someone else. Defensive Field. As a bonus action, you can gain temporary hit points equal to your level in this class, replacing any temporary hit points you already have. You lose these temporary hit points if you doff the armor. You can use this bonus action a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest. Infiltrator) You customize your armor for subtle undertakings. It has the following features: Lightning Launcher. A gemlike node appears on one of your armored fists or on the chest (your choice). It counts as a simple ranged weapon, with a normal range of 90 feet and a long range of 300 feet, and it deals 1d6 lightning damage on a hit. Once on each of your turns when you hit a creature with it, you can deal an extra 1d6 lightning damage to that target. Powered Steps. Your walking speed increases by 5 feet. Dampening Field. You have advantage on Dexterity (Stealth) checks. If the armor normally imposes disadvantage on such checks, the advantage and disadvantage cancel each other, as normal."
                        },
                        {
                            "level": 5,
                            "name": "Extra Attack",
                            "desc": "You can attack twice, rather than once, whenever you take the Attack action on your turn."
                        },
                        {
                            "level": 9,
                            "name": "Armor Modifications",
                            "desc": "You learn how to use your artificer infusions to specially modify your Arcane Armor. That armor now counts as separate items for the purposes of your Infuse Items feature: armor (the chest piece), boots, helmet, and the armor’s special weapon. Each of those items can bear one of your infusions, and the infusions transfer over if you change your armor’s model with the Armor Model feature. In addition, the maximum number of items you can infuse at once increases by 2, but those extra items must be part of your Arcane Armor."
                        },
                        {
                            "level": 15,
                            "name": "Perfected Armor",
                            "desc": "Your Arcane Armor gains additional benefits based on its model, as shown below. Guardian. When a Huge or smaller creature you can see ends its turn within 30 feet of you, you can use your reaction to magically force it to make a Strength saving throw against your spell save DC. On a failed save, you pull the creature up to 25 feet directly to an unoccupied space. If you pull the target to a space within 5 feet of you, you can make a melee weapon attack against it as part of this reaction. You can use this reaction a number of times equal to your proficiency bonus, and you regain all expended uses of it when you finish a long rest. Infiltrator. Any creature that takes lightning damage from your Lightning Launcher glimmers with magical light until the start of your next turn. The glimmering creature sheds dim light in a 5-foot radius, and it has disadvantage on attack rolls against you, as the light jolts it if it attacks you. In addition, the next attack roll against it has advantage, and if that attack hits, the target takes an extra 1d6 lightning damage."
                        }
                    ],
                    "spells": [
                        {
                            "level": 3,
                            "name": "magic missile",
                            "index": "magic_missile"
                        },
                        {
                            "level": 3,
                            "name": "thunderwave",
                            "index": "thunderwave"
                        },
                        {
                            "level": 5,
                            "name": "mirror image,",
                            "index": "mirror_image,"
                        },
                        {
                            "level": 5,
                            "name": "shatter",
                            "index": "shatter"
                        },
                        {
                            "level": 9,
                            "name": "hypnotic pattern",
                            "index": "hypnotic_pattern"
                        },
                        {
                            "level": 9,
                            "name": "lightning bolt",
                            "index": "lightning_bolt"
                        },
                        {
                            "level": 13,
                            "name": "fire shield",
                            "index": "fire_shield"
                        },
                        {
                            "level": 13,
                            "name": "greater invisibility",
                            "index": "greater_invisibility"
                        },
                        {
                            "level": 17,
                            "name": "passwall",
                            "index": "passwall"
                        },
                        {
                            "level": 17,
                            "name": "wall of force",
                            "index": "wall_of_force"
                        }
                    ]
                },
                {
                    "name": "Artillerist",
                    "features": [
                    ]
                }
            ]
        },
        {
            "name": "Barbarian",
            "starting_gold_d4s" : 2,
            "spell_casting": {
                "type": 0.0
            },
            "subclass_level": 3,
            "hit_die": 12,
            "proficiency_choices": [
                {
                    "name": "Choose two from Animal Handling, Athletics, Intimidation, Nature, Perception, and Survival",
                    "choose": 2,
                    "from": [
                        {
                            "name": "Animal Handling"
                        },
                        {
                            "name": "Athletics"
                        },
                        {
                            "name": "Intimidation"
                        },
                        {
                            "name": "Nature"
                        },
                        {
                            "name": "Perception"
                        },
                        {
                            "name": "Survival"
                        }
                    ]
                }
            ],
            "proficiencies": [
                {
                    "name": "Light armor"
                },
                {
                    "name": "Medium armor"
                },
                {
                    "name": "Shields"
                },
                {
                    "name": "Simple weapons"
                },
                {
                    "name": "Martial weapons"
                },
                {
                    "name": "Intimidation"
                },
                {
                    "name": "Saving throw (Strength)"
                },
                {
                    "name": "Saving throw (Constitution)"
                }
            ],
            "equipment": [
                {
                    "name": "any two simple weapons",
                    "choose": 2,
                    "from": [
                        {
                            "index": "simple_weapons"
                        }
                    ]
                }
            ],
            "features": [
                {
                    "name": "Rage",
                    "level": 1,
                    "desc": "In battle, you fight with primal ferocity. On your turn, you can enter a rage as a bonus action. While raging, you gain the following benefits if you aren’t wearing heavy armor: You have advantage on Strength checks and Strength saving throws. When you make a melee weapon attack using Strength, you gain a bonus to the damage roll that increases as you gain levels as a barbarian, as shown in the Rage Damage column of the Barbarian table. You have resistance to bludgeoning, piercing, and slashing damage. If you are able to cast spells, you can’t cast them or concentrate on them while raging. Your rage lasts for 1 minute. It ends early if you are knocked unconscious or if your turn ends and you haven’t attacked a hostile creature since your last turn or taken damage since then. You can also end your rage on your turn as a bonus action. Once you have raged the number of times shown for your barbarian level in the Rages column of the Barbarian table, you must finish a long rest before you can rage again."
                },
                {
                    "name": "Unarmored Defense",
                    "desc": "While you are not wearing any armor, your Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit.",
                    "level": 1
                },
                {
                    "name": "Reckless Attack",
                    "desc": "Starting at 2nd level, you can throw aside all concern for defense to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee weapon attack rolls using Strength during this turn, but attack rolls against you have advantage until your next turn.",
                    "level": 2
                },
                {
                    "name": "Danger Sense",
                    "desc": "At 2nd level, you gain an uncanny sense of when things nearby aren’t as they should be, giving you an edge when you dodge away from danger. You have advantage on Dexterity saving throws against effects that you can see, such as traps and spells. To gain this benefit, you can’t be blinded, deafened, or incapacitated.",
                    "level": 2
                },
                {
                    "name": "Extra Attack",
                    "desc": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.",
                    "level": 5
                },
                {
                    "name": "Fast Movement",
                    "desc": "Starting at 5th level, your speed increases by 10 feet while you aren’t wearing heavy armor.",
                    "level": 5
                },
                {
                    "name": "Feral Instinct",
                    "desc": "By 7th level, your instincts are so honed that you have advantage on initiative rolls. Additionally, if you are surprised at the beginning of combat and aren’t incapacitated, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn.",
                    "level": 7
                },
                {
                    "name": "Brutal Critical",
                    "desc": "Beginning at 9th level, you can roll one additional weapon damage die when determining the extra damage for a critical hit with a melee attack. This increases to two additional dice at 13th level and three additional dice at 17th level.",
                    "level": 9
                },
                {
                    "name": "Relentless Rage",
                    "desc": "Starting at 11th level, your rage can keep you fighting despite grievous wounds. If you drop to 0 hit points while you’re raging and don’t die outright, you can make a DC 10 Constitution saving throw. If you succeed, you drop to 1 hit point instead. Each time you use this feature after the first, the DC increases by 5. When you finish a short or long rest, the DC resets to 10.",
                    "level": 11
                },
                {
                    "name": "Brutal Critical",
                    "desc": "At 13th level, you can roll two additional weapon damage dice when determining the extra damage for a critical hit with a melee attack. This increases to three additional dice at 17th level.",
                    "level": 13
                },
                {
                    "name": "Persistent Rage",
                    "desc": "Beginning at 15th level, your rage is so fierce that it ends early only if you fall unconscious or if you choose to end it.",
                    "level": 15
                },
                {
                    "name": "Brutal Critical",
                    "desc": "At 17th level, you can roll three additional weapon damage dice when determining the extra damage for a critical hit with a melee attack.",
                    "level": 17
                },
                {
                    "name": "Indomitable Might",
                    "desc": "Beginning at 18th level, if your total for a Strength check is less than your Strength score, you can use that score in place of the total.",
                    "level": 18
                },
                {
                    "name": "Primal Champion",
                    "desc": "At 20th level, you embody the power of the wilds. Your Strength and Constitution scores increase by 4. Your maximum for those scores is now 24.",
                    "level": 20
                }
            ],
            "subclasses": []
        },
        {
            "name": "Bard",
            "starting_gold_d4s" : 5,
            "spell_casting": {
                "type": 1,
                "casting_ability": "Cha",
                "spells_known": [
                    4,
                    5,
                    6,
                    7,
                    8,
                    9,
                    10,
                    11,
                    12,
                    14,
                    15,
                    15,
                    16,
                    18,
                    19,
                    19,
                    20,
                    23,
                    23,
                    23
                ],
                "cantrips_known": [
                    2,
                    2,
                    2,
                    3,
                    3,
                    3,
                    3,
                    3,
                    3,
                    4,
                    4,
                    4,
                    4,
                    4,
                    4,
                    4,
                    4,
                    4,
                    4,
                    4
                ],
                "spell_slots": [
                    [
                        2
                    ],
                    [
                        3
                    ],
                    [
                        3
                    ],
                    [
                        4,
                        2
                    ],
                    [
                        4,
                        3,
                        2
                    ],
                    [
                        4,
                        3,
                        3
                    ],
                    [
                        4,
                        3,
                        3,
                        1
                    ],
                    [
                        4,
                        3,
                        3,
                        2
                    ],
                    [
                        4,
                        3,
                        3,
                        3,
                        1
                    ],
                    [
                        4,
                        3,
                        3,
                        3,
                        2
                    ],
                    [
                        4,
                        3,
                        3,
                        3,
                        2,
                        1
                    ],
                    [
                        4,
                        3,
                        3,
                        3,
                        2,
                        1
                    ],
                    [
                        4,
                        3,
                        3,
                        3,
                        2,
                        1,
                        1
                    ],
                    [
                        4,
                        3,
                        3,
                        2,
                        1,
                        1,
                        1
                    ],
                    [
                        4,
                        3,
                        3,
                        2,
                        1,
                        1,
                        1,
                        1
                    ],
                    [
                        4,
                        3,
                        3,
                        3,
                        1,
                        1,
                        1,
                        1
                    ],
                    [
                        4,
                        3,
                        3,
                        3,
                        1,
                        1,
                        1,
                        1,
                        1
                    ],
                    [
                        4,
                        3,
                        3,
                        3,
                        2,
                        1,
                        1,
                        1,
                        1
                    ],
                    [
                        4,
                        3,
                        3,
                        3,
                        3,
                        1,
                        1,
                        1,
                        1
                    ],
                    [
                        4,
                        3,
                        3,
                        3,
                        3,
                        2,
                        1,
                        1,
                        1
                    ],
                    [
                        4,
                        3,
                        3,
                        3,
                        3,
                        2,
                        2,
                        1,
                        1
                    ]
                ]
            },
            "hit_die": 8,
            "subclass_level": 3,
            "proficiency_choices": [
                {
                    "name": "Choose any three skill proficiencies.",
                    "choose": 3,
                    "from": [
                        {
                            "index": "skill_proficiencies"
                        }
                    ]
                }
            ],
            "proficiencies": [
                {
                    "name": "Light armor"
                },
                {
                    "name": "Simple weapons"
                },
                {
                    "name" : "Hand crossbows"
                },
                {
                    "name" : "Longswords"
                },
                {
                    "name" : "Rapiers"
                },
                {
                    "name" : "Shortswords"
                },
                {
                    "name": "Three musical instruments of your choice",
                    "choose": 3,
                    "from": [
                        {
                            "index": "musical_instruments"
                        }
                    ]
                },
                {
                    "name" : "Saving throw (Dexterity)"
                },
                {
                    "name" : "Saving throw (Charisma)"
                },
                {
                    "name": "Survival"
                }
            ],
            "equipment": [
                {
                    "name": "A diplomat’s pack or an entertainer’s pack",
                    "choose": 1,
                    "from": [
                        {
                            "name": "diplomat’s pack"
                        },
                        {
                            "name": "entertainer’s pack"
                        }
                    ]
                },
                {
                    "name": "A rapier, a longsword, or any simple weapon",
                    "choose": 1,
                    "from": [
                        {
                            "name": "Any simple weapon",
                            "index": "simple_weapons"
                        },
                        {
                            "name": "longsword",
                            "index": "longsword"
                        },
                        {
                            "name": "rapier",
                            "index": "rapier"
                        }
                    ]
                },
                {
                    "name": "A lute or any other musical instrument",
                    "choose": 1,
                    "from": [
                        {
                            "name": "Any musical instrument",
                            "options_index": "musical_instrument"
                        },
                        {
                            "name": "lute"
                        }
                    ]
                },
                {
                    "name": "Leather armor",
                    "index": "Leather armor"
                },
                {
                    "name": "Dagger",
                    "index": "Dagger"
                }
            ],
            "features": [
                {
                    "name": "Bardic Inspiration",
                    "desc": "You can inspire others through stirring words or music. To do so, you use a bonus action on your turn to choose one creature other than yourself within 60 feet of you who can hear you. That creature gains one Bardic Inspiration die, a d6. Once within the next 10 minutes, the creature can roll the die and add the number rolled to one ability check, attack roll, or saving throw it makes. The creature can wait until after it rolls the d20 before deciding to use the Bardic Inspiration die, but must decide before the DM says whether the roll succeeds or fails. Once the Bardic Inspiration die is rolled, it is lost. A creature can have only one Bardic Inspiration die at a time. You can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain any expended uses when you finish a long rest. Your Bardic Inspiration die changes when you reach certain levels in this class. The die becomes a d8 at 5th level, a d10 at 10th level, and a d12 at 15th level.",
                    "level": 1
                },
                {
                    "name": "Jack of All Trades",
                    "desc": "Beginning at 2nd level, you can use soothing music or oration to help revitalize your wounded allies during a short rest. If you or any friendly creatures who can hear your performance regain hit points at the end of the short rest by spending one or more Hit Dice, each of those creatures regains an extra 1d6 hit points. The extra hit points increase when you reach certain levels in this class: to 1d8 at 9th level, to 1d10 at 13th level, and to 1d12 at 17th level.",
                    "level": 2
                },
                {
                    "name": "Song of Rest",
                    "desc": "Starting at 2nd level, you can throw aside all concern for defense to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee weapon attack rolls using Strength during this turn, but attack rolls against you have advantage until your next turn.",
                    "level": 2
                },
                {
                    "name": "Expertise",
                    "desc": "At 3rd level, choose two of your skill proficiencies. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies.",
                    "level": 3,
                    "choose": 2,
                    "from": [
                        {
                            "index": "proficiencies"
                        }
                    ]
                },
                {
                    "name": "Font of Inspiration",
                    "desc": "Beginning when you reach 5th level, you regain all of your expended uses of Bardic Inspiration when you finish a short or long rest.",
                    "level": 5
                },
                {
                    "name": "Countercharm",
                    "desc": "At 6th level, you gain the ability to use musical notes or words of power to disrupt mind-influencing effects. As an action, you can start a performance that lasts until the end of your next turn. During that time, you and any friendly creatures within 30 feet of you have advantage on saving throws against being frightened or charmed. A creature must be able to hear you to gain this benefit. The performance ends early if you are incapacitated or silenced or if you voluntarily end it (no action required).",
                    "level": 6
                },
                {
                    "name": "Expertise",
                    "desc": "At 10th level, choose two more of your skill proficiencies. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies.",
                    "level": 10,
                    "choose": 2,
                    "from": [
                        {
                            "index": "proficiencies"
                        }
                    ]
                },
                {
                    "name": "Magical Secrets",
                    "desc": "By 10th level, you have plundered magical knowledge from a wide spectrum of disciplines. Choose two spells from any classes, including this one. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip. The chosen spells count as bard spells for you and are included in the number in the Spells Known column of the Bard table. You learn two additional spells from any classes at 14th level and again at 18th level.",
                    "level": 10,
                    "choose": 2,
                    "from": [
                        {
                            "index": "all_spells",
                            "bound": 5
                        }
                    ]
                },
                {
                    "name": "Magical Secrets",
                    "desc": "At 14th level, you have plundered magical knowledge from a wide spectrum of disciplines. Choose two spells from any classes, including this one. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip. The chosen spells count as bard spells for you and are included in the number in the Spells Known column of the Bard table. You learn two additional spells from any classes at 18th level.",
                    "level": 14,
                    "choose": 2,
                    "from": [
                        {
                            "index": "all_spells",
                            "bound": 7
                        }
                    ]
                },
                {
                    "name": "Magical Secrets",
                    "desc": "At 18th level, you have plundered magical knowledge from a wide spectrum of disciplines. Choose two spells from any classes, including this one. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip. The chosen spells count as bard spells for you and are included in the number in the Spells Known column of the Bard table.",
                    "choose": 2,
                    "from": [
                        {
                            "index": "all_spells",
                            "bound": 9
                        }
                    ],
                    "level": 18
                },
                {
                    "name": "Superior Inspiration",
                    "desc": "At 20th level, when you roll initiative and have no uses of Bardic Inspiration left, you regain one use.",
                    "level": 20
                }
            ],
            "subclasses": []
        },
        {
            "name": "Cleric",
            "starting_gold_d4s" : 5,
            "subclass_level": 1,
            "spell_casting": {
                "type": 1,
                "casting_ability": "Wis",
                "prepare_from": "all",
                "preparation_mod_multiplier": 1,
                "cantrips_known": [
                    3,
                    3,
                    3,
                    4,
                    4,
                    4,
                    4,
                    4,
                    4,
                    5,
                    5,
                    5,
                    5,
                    5,
                    5,
                    5,
                    5,
                    5,
                    5,
                    5
                ],
                "spell_slots": [
                    [
                        2
                    ],
                    [
                        3
                    ],
                    [
                        4,
                        2
                    ],
                    [
                        4,
                        3
                    ],
                    [
                        4,
                        3,
                        2
                    ],
                    [
                        4,
                        3,
                        3
                    ],
                    [
                        4,
                        3,
                        3,
                        1
                    ],
                    [
                        4,
                        3,
                        3,
                        2
                    ],
                    [
                        4,
                        3,
                        3,
                        3,
                        1
                    ],
                    [
                        4,
                        3,
                        3,
                        3,
                        2
                    ],
                    [
                        4,
                        3,
                        3,
                        3,
                        2,
                        1
                    ],
                    [
                        4,
                        3,
                        3,
                        3,
                        2,
                        1
                    ],
                    [
                        4,
                        3,
                        3,
                        3,
                        2,
                        1,
                        1
                    ],
                    [
                        4,
                        3,
                        3,
                        3,
                        2,
                        1,
                        1
                    ],
                    [
                        4,
                        3,
                        3,
                        3,
                        2,
                        1,
                        1,
                        1
                    ],
                    [
                        4,
                        3,
                        3,
                        3,
                        2,
                        1,
                        1,
                        1
                    ],
                    [
                        4,
                        3,
                        3,
                        3,
                        2,
                        1,
                        1,
                        1,
                        1
                    ],
                    [
                        4,
                        3,
                        3,
                        3,
                        3,
                        1,
                        1,
                        1,
                        1
                    ],
                    [
                        4,
                        3,
                        3,
                        3,
                        3,
                        2,
                        1,
                        1,
                        1
                    ],
                    [
                        4,
                        3,
                        3,
                        3,
                        3,
                        2,
                        2,
                        1,
                        1
                    ]
                ]
            },
            "hit_die": 8,
            "proficiency_choices": [
                {
                    "name": "Choose two from History, Insight, Medicine, Persuasion, and Religion",
                    "choose": 2,
                    "from": [
                        {
                            "name": "History"
                        },
                        {
                            "name": "Insight"
                        },
                        {
                            "name": "Medicine"
                        },
                        {
                            "name": "Persuasion"
                        },
                        {
                            "name": "Religion"
                        }
                    ]
                }
            ],
            "proficiencies": [
                {
                    "name" : "Light armor"
                },
                {
                    "name" : "Medium armor"
                },
                {
                    "name" : "Shield"
                },
                {
                    "name": "Simple weapons"
                },
                {
                    "name": "Saving throw (Wisdom)"
                },
                {
                    "name": "Saving throw (Charisma)"
                }
            ],
            "equipment": [
                {
                    "name": "A mace or a warhammer (if proficient)",
                    "choose": 1,
                    "from": [
                        {
                            "name": "Mace",
                            "index": "Mace"
                        },
                        {
                            "name": "Warhammer",
                            "index": "Warhammer"
                        }
                    ]
                },
                {
                    "name": "Scale mail, leather armor, or chain mail (if proficient)",
                    "choose": 1,
                    "from": [
                        {
                            "name": "chain mail",
                            "index": "chain mail"
                        },
                        {
                            "name": "scale mail",
                            "index": "scale mail"
                        },
                        {
                            "name": "Leather armor",
                            "index": "Leather armor"
                        }
                    ]
                },
                {
                    "name": "A light crossbow and 20 bolts or any simple weapon",
                    "choose": 1,
                    "from": [
                        {
                            "index": "simple_weapons"
                        },
                        {
                            "name": "light crossbow"
                        }
                    ]
                },
                {
                    "name": "A priest’s pack or an explorer’s pack",
                    "choose": 1,
                    "from": [
                        {
                            "name": "priest’s pack"
                        },
                        {
                            "name": "explorer’s pack"
                        }
                    ]
                }
            ],
            "features": [
                {
                    "name" : "Harness Divine Power (Optional)",
                    "level" : 2,
                    "desc" : "At 2nd level, you can expend a use of your Channel Divinity to fuel your spells. As a bonus action, you touch your holy symbol, utter a prayer, and regain one expended spell slot, the level of which can be no higher than half your proficiency bonus (rounded up). The number of times you can use this feature is based on the level you've reached in this class: 2nd level, once; 6th level, twice; and 18th level, thrice. You regain all expended uses when you finish a long rest."
                },
                {
                    "name" : "Destroy Undead",
                    "level" : 5,
                    "desc" :"Starting at 5th level, when an undead fails its saving throw against your Turn Undead feature, the creature is instantly destroyed if its challenge rating is at or below a certain threshold, as shown in the Cleric table above."
                },
                {
                    "name" : "Blessed Strikes (Optional)",
                    "level": 8,
                    "desc" : "Replaces the Divine Strike or Potent Spellcasting feature\n\nWhen you reach 8th level, you are blessed with divine might in battle. When a creature takes damage from one of your cantrips or weapon attacks, you can also deal 1d8 radiant damage to that creature. Once you deal this damage, you can't use this feature again until the start of your next turn."
                },
                {
                    "name" : "Divine Intervention",
                    "level" : 10,
                    "desc" : "Beginning at 10th level, you can call on your deity to intervene on your behalf when your need is great.\n\nImploring your deity's aid requires you to use your action. Describe the assistance you seek, and roll percentile dice. If you roll a number equal to or lower than your cleric level, your deity intervenes. The DM chooses the nature of the intervention; the effect of any cleric spell or cleric domain spell would be appropriate. If your deity intervenes, you can't use this feature again for 7 days. Otherwise, you can use it again after you finish a long rest.\n\nAt 20th level, your call for intervention succeeds automatically, no roll required."
                }
            ],
            "subclasses": [
                {
                    "name" : "Arcana Domain",
                    "spells" : [
                        {
                            "name" : "Detect Magic",
                            "index" : "detect_magic",
                            "level" : 1
                        },
                        {
                            "name" : "Magic Missile",
                            "index" : "magic_missile",
                            "level" : 1
                        },
                        {
                            "name" : "Magic Weapon",
                            "index" : "magic_weapon",
                            "level": 3
                        },
                        {
                            "name" : "Nystul's Magic Aura",
                            "index" : "nystuls_magic_aura",
                            "level" : 3
                        },
                        {
                            "name" : "Dispel Magic",
                            "index" : "dispel_magic",
                            "level" : 5
                        },
                        {
                            "name" : "Magic Circle",
                            "index" : "magic_circle",
                            "level" : 5
                        },
                        {
                            "name" : "Arcane Eye",
                            "index" : "arcane_eye",
                            "level" : 7
                        },
                        {
                            "name" : "Leomund's Secret Chest",
                            "index" : "leomunds_secret_chest",
                            "level" : 7
                        },
                        {
                            "name" : "Planar Binding",
                            "index" : "planar_binding",
                            "level" : 7
                        },
                        {
                            "name" : "Teleportation Circle",
                            "index" : "teleportation_circle",
                            "level" : 9
                        }
                    ],
                    "features" : [
                        {
                            "name" : "Arcane Initiate",
                            "desc" : "When you choose this domain at 1st level, you gain proficiency in the Arcana skill, and you gain two cantrips of your choice from the wizard spell list. For you, these cantrips count as cleric cantrips",
                            "level" : 1
                        },
                        {
                            "name" : "Channel Divinity: Arcane Abjuration",
                            "desc" : "Starting at 2nd level, you can use your Channel Divinity to abjure otherworldly creatures.\n\nAs an action, you present your holy symbol, and one celestial, elemental, fey, or fiend of your choice that is within 30 feet of you must make a Wisdom saving throw, provided that the creature can see or hear you. If the creature fails its saving throw, it is turned for 1 minute or until it takes any damage.\n\nA turned creature must spend its turns trying to move as far away from you as it can, and it can't willingly end its move in a space within 30 feet of you. It also can't take reactions. For its action, it can only use the Dash action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can use the Dodge action.\n\nAfter you reach 5th level, when a creature fails its saving throw against your Arcane Abjuration feature, the creature is banished for 1 minute (as in the Banishment spell, no concentration required) if it isn't on its plane of origin and its challenge rating is at or below a certain threshold, as shown on the Arcane Banishment table.",
                            "comment" : "TODO add this table",
                            "level" : 2
                        },
                        {
                            "name" : "Spell Breaker",
                            "level" : 6,
                            "desc" : "Starting at 6th level, when you restore hit points to an ally with a spell of 1st level or higher, you can also end one spell of your choice on that creature. The level of the spell you end must be equal to or lower than the level of the spell slot you use to cast the healing spell."
                        },
                        {
                            "name" : "Potent Spellcasting",
                            "level" : 8,
                            "desc" : "Starting at 8th level, you add your Wisdom modifier to the damage you deal with any cleric cantrip."
                        },
                        {
                            "name" : "Arcane Mastery",
                            "level" : 17,
                            "desc" : "At 17th level, you choose four spells from the wizard spell list, one from each of the following levels: 6th, 7th, 8th, and 9th. You add them to your list of domain spells. Like your other domain spells, they are always prepared and count as cleric spells for you."
                        }
                    ]
                },
                {
                    "name" : "Death Domain",
                    "spells" : [
                        {
                            "name" : "False Life",
                            "level" : 1,
                            "index" : "false_life"
                        },
                        {
                            "name" : "Ray of Sickness",
                            "level" : 1,
                            "index" : "ray_of_sickness"
                        },
                        {
                            "name" : "Blindness/Deafness",
                            "index" : "blindness/deafness",
                            "level": 3
                        },
                        {
                            "name" : "Ray of Enfeeblement",
                            "index": "ray_of_enfeeblement",
                            "level" : 3
                        },
                        {
                            "name" : "Animate Dead",
                            "index" : "animate_dead",
                            "level" : 5
                        },
                        {
                            "name" : "Vampiric Touch",
                            "index" : "vampiric_touch",
                            "level" : 5
                        },
                        {
                            "name" : "Blight",
                            "index" : "blight",
                            "level" : 7
                        },
                        {
                            "name" : "Death Ward",
                            "index" : "death_ward",
                            "level" : 7
                        },
                        {
                            "name" : "Antilife shell",
                            "index" : "antilife_shell",
                            "level" : 9
                        },
                        {
                            "name" : "Cloudkill",
                            "index" : "cloudkill",
                            "level" : 9
                        }
                    ],
                    "features" : [

                    ]
                }
            ]
        },
        {
            "name" : "Druid",
            "starting_gold_d4s" : 2,
            "subclass_level": 2,
            "spell_casting" : {
                "type" : 1,
                "casting_ability" : "Wis",
                "prepare_from" : "all",
                "preparation_mod_multiplier": 1,
                "cantrips_known" : [
                    2, 2, 2,
                    3, 3, 3, 3, 3, 3,
                    4, 4, 4, 4, 4, 4, 4, 4, 4, 4
                ],
                "spell_slots" : [
                    [2],
                    [3],
                    [4, 2],
                    [4, 3],
                    [4, 3, 2],
                    [4, 3 , 3],
                    [4, 3, 3, 1],
                    [4, 3, 3, 2],
                    [4, 3, 3, 3, 1],
                    [4, 3, 3, 3, 2],
                    [4, 3, 3, 3, 2, 1],
                    [4, 3, 3, 3, 2, 1],
                    [4, 3, 3, 3, 2, 1, 1],
                    [4, 3, 3, 3, 2, 1, 1],
                    [4, 3, 3, 3, 2, 1, 1, 1],
                    [4, 3, 3, 3, 2, 1, 1, 1, 1],
                    [4, 3, 3, 3, 3, 1, 1, 1, 1],
                    [4, 3, 3, 3, 3, 2, 1, 1, 1],
                    [4, 3, 3, 3, 3, 2, 2, 1, 1]
                ]
            },
            "hit_die": 8,
            "proficiencies_choices" : [
                {
                    "name" : "Choose two from Arcana, Animal Handling, Insight, Medicine, Nature, Perception, Religion, and Survival",
                    "choose" : 2,
                    "from" : [
                        { "name" : "Arcana"},
                        { "name" : "Animal Handling"},
                        { "name" : "Insight"},
                        { "name" : "Medicine"},
                        { "name" : "Nature"},
                        { "name" : "Perception"},
                        { "name" : "Religion"},
                        { "name" : "Survival"}
                    ]
                }
            ],
            "proficiencies" : [
                {
                    "name" : "Light armor"
                },
                {
                    "name" : "Medium armor"
                },
                {
                    "name" : "Shields"
                },
                {
                    "name" : "Clubs",
                    "index" : "club"
                },
                {
                    "name" : "Daggers",
                    "index" : "dagger"
                },
                {
                    "name" : "Darts",
                    "index" : "dart"
                },
                {
                    "name" : "Javelins",
                    "index" : "javelin"
                },
                {
                    "name" : "Maces",
                    "index" : "mace"
                },
                {
                    "name" : "Quarterstaffs",
                    "index" : "quarterstaff"
                },
                {
                    "name" : "Scimitars",
                    "index" : "scimitar"
                },
                {
                    "name" : "Sickles",
                    "index" : "sickle"
                },
                {
                    "name" : "Slings",
                    "index" : "sling"
                },
                {
                    "name" : "Spears",
                    "index" : "spear"
                },
                {
                    "name" : "Herbalism Kit"
                },
                {
                    "name": "Saving throw (Intelligence)"
                },
                {
                    "name": "Saving throw (Wisdom)"
                }
            ],
            "equipment" : [
                {
                    "name" : "A wooden shield or any simple weapon",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "A wooden shield",
                            "index" : "Shield"
                        },
                        {
                            "name" : "Any simple weapon",
                            "index" : "simple_weapons"
                        }
                    ]
                },
                {
                    "name" : "A scimitar or any simple melee weapon",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "Scimitar",
                            "index" : "scimitar"
                        },
                        {
                            "name" : "Any simple melee weapon",
                            "index" : "simple_weapons",
                            "bound" : "melee"
                        }
                    ]
                },
                {
                    "name" : "Leather armor",
                    "index" : "leather armor"
                },
                {
                    "name" : "Explorer's pack"
                },
                {
                    "name" : "Druidic focus"
                }
            ],
            "features" : [
                {
                    "name" : "Druidic",
                    "desc" : "You know Druidic, the secret language of druids. You can speak the language and use it to leave hidden messages. You and others who know this language automatically spot such a message. Others spot the message's presence with a successful DC 15 Wisdom (Perception) check but can't decipher it without magic.",
                    "level" : 1
                },
                {
                    "name" : "Wild Shape",
                    "desc" : "Starting at 2nd level, you can use your action to magically assume the shape of a beast that you have seen before. You can use this feature twice. You regain expended uses when you finish a short or long rest.\n\nYour druid level determines the beasts you can transform into, as shown in the Beast Shapes table. At 2nd level, for example, you can transform into any beast that has a challenge rating of 1/4 or lower that doesn't have a flying or swimming speed.\nBeast Shapes\nLevel \tMax. CR \tLimitations \tExample\n2nd \t1/4 \tNo flying or swimming speed \tWolf\n4th \t1/2 \tNo flying speed \tCrocodile\n8th \t1 \t\tGiant eagle\n\nYou can stay in a beast shape for a number of hours equal to half your druid level (rounded down). You then revert to your normal form unless you expend another use of this feature. You can revert to your normal form earlier by using a bonus action on your turn. You automatically revert if you fall unconscious, drop to 0 hit points, or die.\n\nWhile you are transformed, the following rules apply:\n\n    Your game statistics are replaced by the statistics of the beast, but you retain your alignment, personality, and Intelligence, Wisdom, and Charisma scores. You also retain all of your skill and saving throw proficiencies, in addition to gaining those of the creature. If the creature has the same proficiency as you and the bonus in its stat block is higher than yours, use the creature's bonus instead of yours. If the creature has any legendary or lair actions, you can't use them.\n\n    When you transform, you assume the beast's hit points and Hit Dice. When you revert to your normal form, you return to the number of hit points you had before you transformed. However, if you revert as a result of dropping to 0 hit points, any excess damage carries over to your normal form, For example, if you take 10 damage in animal form and have only 1 hit point left, you revert and take 9 damage. As long as the excess damage doesn't reduce your normal form to 0 hit points, you aren't knocked unconscious.\n\n    You can't cast spells, and your ability to speak or take any action that requires hands is limited to the capabilities of your beast form. Transforming doesn't break your concentration on a spell you've already cast, however, or prevent you from taking actions that are part of a spell, such as Call Lightning, that you've already cast.\n\n    You retain the benefit of any features from your class, race, or other source and can use them if the new form is physically capable of doing so. However, you can't use any of your special senses, such as darkvision, unless your new form also has that sense.\n\n    You choose whether your equipment falls to the ground in your space, merges into your new form, or is worn by it. Worn equipment functions as normal, but the DM decides whether it is practical for the new form to wear a piece of equipment, based on the creature's shape and size. Your equipment doesn't change size or shape to match the new form, and any equipment that the new form can't wear must either fall to the ground or merge with it. Equipment that merges with the form has no effect until you leave the form.",
                    "level" : 2
                },
                {
                    "name" : "Wild Companion (Optional)",
                    "desc" : "At 2nd level, you gain the ability to summon a spirit that assumes an animal form: as an action, you can expend a use of your Wild Shape feature to cast the Find Familiar spell, without material components.\n\nWhen you cast the spell in this way, the familiar is a fey instead of a beast, and the familiar disappears after a number of hours equal to half your druid level.",
                    "level" : 2
                },
                {
                    "name" : "Timeless Body",
                    "desc" : "Starting at 18th level, the primal magic that you wield causes you to age more slowly. For every 10 years that pass, your body ages only 1 year.",
                    "level" : 18
                },
                {
                    "name" : "Beast Spells",
                    "desc" : "Beginning at 18th level, you can cast many of your druid spells in any shape you assume using Wild Shape. You can perform the somatic and verbal components of a druid spell while in a beast shape, but you aren't able to provide material components.",
                    "level" : 18
                },
                {
                    "name" : "Archdruid",
                    "desc" : "At 20th level, you can use your Wild Shape an unlimited number of times.\n\nAdditionally, you can ignore the verbal and somatic components of your druid spells, as well as any material components that lack a cost and aren't consumed by a spell. You gain this benefit in both your normal shape and your beast shape from Wild Shape.",
                    "level" : 20
                }
            ],
            "subclasses" :[

            ]
        },
        {
            "name" : "Fighter",
            "starting_gold_d4s" : 5,
            "subclass_level" : 3,
            "spell_casting": {
                "type": 0.0
            },
            "hit_die" : 10,
            "proficiencies_choices" : [
                {
                    "name" : "Choose two skills from Acrobatics, Animal Handling, Athletics, History, Insight, Intimidation, Perception, and Survival",
                    "choose" : 2,
                    "from" : [
                        { "name" : "Acrobatics"},
                        { "name" : "Animal Handling"},
                        { "name" : "Athletics"},
                        { "name" : "History"},
                        { "name" : "Insight"},
                        { "name" : "Intimidation"},
                        { "name" : "Perception"},
                        { "name" : "Survival"}
                    ]
                }
            ],
            "proficiencies" : [
                {
                    "name" : "Simple weapons"
                },
                {
                    "name" : "Martial weapons"
                },
                {
                    "name": "Saving throw (Strength)"
                },
                {
                    "name": "Saving throw (Constitution)"
                },
                {
                    "name" : "Shields"
                },
                {
                    "name" : "Light armor"
                },
                {
                    "name" : "Medium armor"
                },
                {
                    "name" : "Heavy armor"
                }
            ],
            "equipment" : [
                {
                    "name" : "Chain mail or leather, longbow, and 20 arrows",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "Chain mail",
                            "index" : "chain mail"
                        },
                        {
                            "name" : "TODO"
                        }
                    ]
                },
                {
                    "name" : "A martial weapon and a shield or two martial weapons",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "A martial weapon",
                            "index" : "martial_weapons"
                        },
                        {
                            "name" : "TODO"
                        }
                    ]
                },
                {
                    "name" : "A light crossbow and 20 bolts or two handaxes",
                    "choose" : 1,
                    "from": [
                        {
                            "name" : "A Light crossbow",
                            "index" : "light crossbow"
                        },
                        {
                            "name" : "TODO"
                        }
                    ]
                },
                {
                    "name" : "A dungeoneer's pack or an explorer's pack",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "Dungeoneer's pack"
                        },
                        {
                            "name" : "Explorer's pack"
                        }
                    ]
                }
            ],
            "features" : [
                {
                    "name" : "Fighting Style",
                    "level" : 1,
                    "desc" : "You adopt a particular style of fighting as your specialty. Choose one of the following options. You can't take a Fighting Style option more than once, even if you later get to choose again.",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "Archery",
                            "desc" : "You gain a +2 bonus to attack rolls you make with ranged weapons.",
                            "comment" : "TODO"
                        },
                        {
                            "name" : "Blind Fighting",
                            "desc" : "You have blindsight with a range of 10 feet. Within that range, you can effectively see anything that isn't behind total cover, even if you're blinded or in darkness. Moreover, you can see an invisible creature within that range, unless the creature successfully hides from you."
                        },
                        {
                            "name" : "Defense",
                            "desc" : "While you are wearing armor, you gain a +1 bonus to AC.",
                            "ac_bonus" : 1,
                            "comment" : "TODO while wearing armor"
                        },
                        {
                            "name" : "Dueling",
                            "desc" : "When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon."
                        },
                        {
                            "name" : "Great Weapon Fighting",
                            "desc" : "When you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2. The weapon must have the two-handed or versatile property for you to gain this benefit."
                        },
                        {
                            "name" : "Interception",
                            "desc" : "When a creature you can see hits a target, other than you, within 5 feet of you with an attack, you can use your reaction to reduce the damage the target takes by 1d10 + your proficiency bonus (to a minimum of 0 damage). You must be wielding a shield or a simple or martial weapon to use this reaction."
                        },
                        {
                            "name" : "Protection",
                            "desc" : "When a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield."
                        },
                        {
                            "name" : "Superior Technique",
                            "desc" : "You learn one maneuver of your choice from among those available to the Battle Master archetype. If a maneuver you use requires your target to make a saving throw to resist the maneuver's effects, the saving throw DC equals 8 + your proficiency bonus + your Strength or Dexterity modifier (your choice.)\n\n    You gain one superiority die, which is a d6 (this die is added to any superiority dice you have from another source). This die is used to fuel your maneuvers. A superiority die is expended when you use it. You regain your expended superiority dice when you finish a short or long rest.",
                            "choose" : 1,
                            "from" : [
                                {
                                    "index" : "maneuvers",
                                    "comment" : "TODO"
                                }
                            ]
                        },
                        {
                            "name" : "Thrown Weapon Fighting",
                            "desc" : "You can draw a weapon that has the thrown property as part of the attack you make with the weapon.\n\n    In addition, when you hit with a ranged attack using a thrown weapon, you gain a +2 bonus to the damage roll."
                        },
                        {
                            "name" : "Two-Weapon Fighting",
                            "desc" : "When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack."
                        },
                        {
                            "name" : "Unarmed Fighting",
                            "desc" : "Your unarmed strikes can deal bludgeoning damage equal to 1d6 + your Strength modifier on a hit. If you aren't wielding any weapons or a shield when you make the attack roll, the d6 becomes a d8.\n\n    At the start of each of your turns, you can deal 1d4 bludgeoning damage to one creature grappled by you."
                        }
                    ]
                },
                {
                    "name" : "Second Wind",
                    "desc" : "You have a limited well of stamina that you can draw on to protect yourself from harm. On your turn, you can use a bonus action to regain hit points equal to 1d10 + your fighter level.\n\nOnce you use this feature, you must finish a short or long rest before you can use it again",
                    "level" : 1
                },
                {
                    "name" : "Action Surge",
                    "desc" : "Starting at 2nd level, you can push yourself beyond your normal limits for a moment. On your turn, you can take one additional action.\n\nOnce you use this feature, you must finish a short or long rest before you can use it again. Starting at 17th level, you can use it twice before a rest, but only once on the same turn.",
                    "level" : 2
                },
                {
                    "name" : "Extra Attack",
                    "desc" : "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.\n\nThe number of attacks increases to three when you reach 11th level in this class and to four when you reach 20th level in this class.",
                    "level" : 5
                },
                {
                    "name" : "Indomitable",
                    "level" : 9,
                    "desc" : "Beginning at 9th level, you can reroll a saving throw that you fail. If you do so, you must use the new roll, and you can't use this feature again until you finish a long rest.\n\nYou can use this feature twice between long rests starting at 13th level and three times between long rests starting at 17th level."
                }
            ],
            "subclasses": [

            ]
        },
        {
            "name" : "Monk",
            "starting_gold_d4s" : 5,
            "staring_gold_multiplier" : 1,
            "comment" : "TODO this",
            "subclass_level" : 3,
            "spell_casting" : {
                "type" : 0.0
            },
            "hit_die" : 8,
            "proficiencies_choices" : [
                {
                    "name" : "Choose two from Acrobatics, Athletics, History, Insight, Religion, and Stealth",
                    "choose" : 2,
                    "from" : [
                        { "name" : "Acrobatics"},
                        { "name" : "Athletics"},
                        { "name" : "History"},
                        { "name" : "Insight"},
                        { "name" : "Religion"},
                        { "name" : "Stealth"}
                    ]
                }
            ],
            "proficiencies" : [
                {
                    "name" : "Simple weapons"
                },
                {
                    "name" : "Shortswords",
                    "index" : "short sword"
                },
                {
                    "name" : "Choose one type of artisan's tools or one musical instrument",
                    "choose" : 1,
                    "from" : [
                        {
                            "index" :"artisans_tools"
                        },
                        {
                            "index" : "musical_instruments"
                        }
                    ]
                },
                {
                    "name": "Saving throw (Strength)"
                },
                {
                    "name": "Saving throw (Dexterity)"
                }
            ],
            "equipment" : [
                {
                    "name" : "A shortsword or any simple weapon",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "Shortsword",
                            "index" : "shortsword"
                        },
                        {
                            "index" : "simple_weapons"
                        }
                    ]
                },
                {
                    "name" : "A dungeoneer's pack or an explorer's pack",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "Dungeoneer's pack"
                        },
                        {
                            "name" : "Explorer's pack"
                        }
                    ]
                },
                {
                    "name" : "10 darts"
                }
            ],
            "subclasses" : [

            ],
            "features" : [
                {
                    "name" : "Unarmored Defense",
                    "desc" : "Beginning at 1st level, while you are wearing no armor and not wielding a shield, your AC equals 10 + your Dexterity modifier + your Wisdom modifier.",
                    "level" : 1
                },
                {
                    "name" : "Martial Arts",
                    "desc" : "At 1st level, your practice of martial arts gives you mastery of combat styles that use unarmed strikes and monk weapons, which are shortswords and any simple melee weapons that don't have the two-handed or heavy property.\n\nYou gain the following benefits while you are unarmed or wielding only monk weapons and you aren't wearing armor or wielding a shield:\n\n    You can use Dexterity instead of Strength for the attack and damage rolls of your unarmed strikes and monk weapons.\n\n    You can roll a d4 in place of the normal damage of your unarmed strike or monk weapon. This die changes as you gain monk levels, as shown in the Martial Arts column of the Monk table.\n\n    When you use the Attack action with an unarmed strike or a monk weapon on your turn, you can make one unarmed strike as a bonus action. For example, if you take the Attack action and attack with a quarterstaff, you can also make an unarmed strike as a bonus action, assuming you haven't already taken a bonus action this turn.\n\nCertain monasteries use specialized forms of the monk weapons. For example, you might use a club that is two lengths of wood connected by a short chain (called a nunchaku) or a sickle with a shorter, straighter blade (called a kama). Whatever name you use for a monk weapon, you can use the game statistics provided for the weapon on the Weapons page.",
                    "level" : 1
                },
                {
                    "name" : "Ki",
                    "level" : 2,
                    "desc" : "Starting at 2nd level, your training allows you to harness the mystic energy of ki. Your access to this energy is represented by a number of ki points. Your monk level determines the number of points you have, as shown in the Ki Points column of the Monk table.\n\nYou can spend these points to fuel various ki features. You start knowing three such features: Flurry of Blows, Patient Defense, and Step of the Wind. You learn more ki features as you gain levels in this class.\n\nWhen you spend a ki point, it is unavailable until you finish a short or long rest, at the end of which you draw all of your expended ki back into yourself. You must spend at least 30 minutes of the rest meditating to regain your ki points.\n\nSome of your ki features require your target to make a saving throw to resist the feature's effects. The saving throw DC is calculated as follows:\n\nKi save DC = 8 + your proficiency bonus + your Wisdom modifier\n\n    Flurry of Blows. Immediately after you take the Attack action on your turn, you can spend 1 ki point to make two unarmed strikes as a bonus action.\n\n    Patient Defense. You can spend 1 ki point to take the Dodge action as a bonus action on your turn.\n\n    Step of the Wind. You can spend 1 ki point to take the Disengage or Dash action as a bonus action on your turn, and your jump distance is doubled for the turn."
                },
                {
                    "name" : "Unarmored Movement",
                    "desc" : "Starting at 2nd level, your speed increases by 10 feet while you are not wearing armor or wielding a shield. This bonus increases when you reach certain monk levels, as shown in the Monk table.\n\nAt 9th level, you gain the ability to move along vertical surfaces and across liquids on your turn without falling during the move.",
                    "level" : 2,
                    "comment" : "TODO scaling bonus"
                },
                {
                    "name" : "Dedicated Weapon (Optional)",
                    "level" : 2,
                    "desc" : "Also at 2nd level, you train yourself to use a variety of weapons as monk weapons, not just simple melee weapons and shortswords. Whenever you finish a short or long rest, you can touch one weapon, focus your ki on it, and then count that weapon as a monk weapon until you use this feature again.\n\nThe chosen weapon must meet these criteria:\n\n    The weapon must be a simple or martial weapon.\n\n    You must be proficient with it.\n\n    It must lack the heavy and special properties."
                },
                {
                    "name" : "Deflect Missiles",
                    "level" : 3,
                    "desc" : "Starting at 3rd level, you can use your reaction to deflect or catch the missile when you are hit by a ranged weapon attack. When you do so, the damage you take from the attack is reduced by 1d10 + your Dexterity modifier + your monk level.\n\nIf you reduce the damage to 0, you can catch the missile if it is small enough for you to hold in one hand and you have at least one hand free. If you catch a missile in this way, you can spend 1 ki point to make a ranged attack with a range of 20/60 using the weapon or piece of ammunition you just caught, as part of the same reaction. You make this attack with proficiency, regardless of your weapon proficiencies, and the missile counts as a monk weapon for the attack."
                },
                {
                    "name" : "Ki-Fueled Attack (Optional)",
                    "level" : 3,
                    "desc" : "Also at 3rd level, if you spend 1 ki point or more as part of your action on your turn, you can make one attack with an unarmed strike or a monk weapon as a bonus action before the end of the turn."
                },
                {
                    "name" : "Slow Fall",
                    "desc" : "Beginning at 4th level, you can use your reaction when you fall to reduce any falling damage you take by an amount equal to five times your monk level."
                },
                {
                    "name" : "Quickened Healing (Optional)",
                    "level" : 4,
                    "desc" : "Also at 4th level, as an action, you can spend 2 ki points and roll a Martial Arts die. You regain a number of hit points equal to the number rolled plus your proficiency bonus."
                },
                {
                    "name" : "Extra Attack",
                    "level" : 5,
                    "desc" : "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
                },
                {
                    "name" : "Stunning Strike",
                    "level": 5,
                    "desc" : "Starting at 5th level, you can interfere with the flow of ki in an opponent's body. When you hit another creature with a melee weapon attack, you can spend 1 ki point to attempt a stunning strike. The target must succeed on a Constitution saving throw or be stunned until the end of your next turn."
                },
                {
                    "name" : "Focused Aim (Optional)",
                    "level" : 5,
                    "desc" : "Also at 5th level, when you miss with an attack roll, you can spend 1 to 3 ki points to increase your attack roll by 2 for each of these ki points you spend, potentially turning the miss into a hit."
                },
                {
                    "name" : "Ki-Empowered Strikes",
                    "level" : 6,
                    "desc" : "Starting at 6th level, your unarmed strikes count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage."
                },
                {
                    "name" : "Evasion",
                    "desc" : "At 7th level, your instinctive agility lets you dodge out of the way of certain area effects, such as a blue dragon's lightning breath or a fireball spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail.",
                    "level" : 7
                },
                {
                    "name" : "Stillness of Mind",
                    "level" : 7,
                    "desc" : "Starting at 7th level, you can use your action to end one effect on yourself that is causing you to be charmed or frightened."
                },
                {
                    "name" : "Purity of Body",
                    "level" : 10,
                    "desc" : "At 10th level, your mastery of the ki flowing through you makes you immune to disease and poison.At 10th level, your mastery of the ki flowing through you makes you immune to disease and poison."
                },
                {
                    "name" : "Tongue of the Sun and Moon",
                    "level" : 13,
                    "desc" : "Starting at 13th level, you learn to touch the ki of other minds so that you understand all spoken languages. Moreover, any creature that can understand a language can understand what you say."
                },
                {
                    "name" : "Diamond Soul",
                    "desc" : "Beginning at 14th level, your mastery of ki grants you proficiency in all saving throws.\n\nAdditionally, whenever you make a saving throw and fail, you can spend 1 ki point to reroll it and take the second result.",
                    "level" : 14
                },
                {
                    "name" : "Timeless Body",
                    "desc" : "At 15th level, your ki sustains you so that you suffer none of the frailty of old age, and you can't be aged magically. You can still die of old age, however. In addition, you no longer need food or water.",
                    "level" : 15
                },
                {
                    "name" : "Empty Body",
                    "level" : 18,
                    "desc" : "Beginning at 18th level, you can use your action to spend 4 ki points to become invisible for 1 minute. During that time, you also have resistance to all damage but force damage.\n\nAdditionally, you can spend 8 ki points to cast the Astral Projection spell, without needing material components. When you do so, you can't take any other creatures with you."
                },
                {
                    "name" : "Perfect Self",
                    "desc" : "At 20th level, when you roll for initiative and have no ki points remaining, you regain 4 ki points.",
                    "level" : 20
                }
            ]
        },
        {
            "name" : "Paladin",
            "starting_gold_d4s" : 5,
            "subclass_level" : 3,
            "hit_die" : 10,
            "spell_casting" : {
                "type" : 0.5,
                "casting_ability" : "Cha",
                "prepare_from" : "all",
                "preparation_mod_multiplier": 0.5,
                "spell_slots" : [
                    [],
                    [2],
                    [3],
                    [3],
                    [4, 2],
                    [4, 2],
                    [4, 3],
                    [4, 3],
                    [4, 3, 2],
                    [4, 3, 2],
                    [4, 3, 3],
                    [4, 3, 3],
                    [4, 3, 3, 1],
                    [4, 3, 3, 1],
                    [4, 3, 3, 2],
                    [4, 3, 3, 2],
                    [4, 3, 3, 3, 1],
                    [4, 3, 3, 3, 1],
                    [4, 3, 3, 3, 2],
                    [4, 3, 3, 3, 2]
                ]
            },
            "proficiencies_choices" : [
                {
                    "name" : "Choose two from Athletics, Insight, Intimidation, Medicine, Persuasion, and Religion",
                    "choose" : 2,
                    "from" : [
                        { "name" : "Athletics"},
                        { "name" : "Insight"},
                        { "name" : "Intimidation"},
                        { "name" : "Medicine"},
                        { "name" : "Persuasion"},
                        { "name" : "Religion"}
                    ]
                }
            ],
            "proficiencies" : [
                {
                    "name" : "Light armor"
                },
                {
                    "name" : "Medium armor"
                },
                {
                    "name" : "Heavy armor"
                },
                {
                    "name" : "Simple weapons"
                },
                {
                    "name" : "Martial weapons"
                },
                {
                    "name": "Saving throw (Wisdom)"
                },
                {
                    "name": "Saving throw (Charisma)"
                }
            ],
            "equipment" : [
                {
                    "name" : "A martial weapon and a shield or two martial weapons",
                    "choose" : 1,
                    "from" : [
                        {
                            "index" : "martial_weapons",
                            "comment" : "TODO"
                        },
                        {
                            "index": "martial_weapons",
                            "comment": "TODO"
                        }
                    ]
                },
                {
                    "name" : "Five javelins or any simple melee weapon",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "Five javalins"
                        },
                        {
                            "index" : "simple_weapons",
                            "bound" : "melee"
                        }
                    ]
                },
                {
                    "name" : "A priest's pack or an explorer's pack",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "A priest's pack"
                        },
                        {
                            "name" : "An explorer's pack"
                        }
                    ]
                },
                {
                    "name" : "Chain mail",
                    "index" : "chain mail"
                },
                {
                    "name" : "A holy symbol",
                    "index" : "holy symbol"
                }
            ],
            "subclasses" : [],
            "features" : [
                {
                    "name" : "Divine Sense",
                    "level" : 1,
                    "desc" : "The presence of strong evil registers on your senses like a noxious odor, and powerful good rings like heavenly music in your ears. As an action, you can open your awareness to detect such forces. Until the end of your next turn, you know the location of any celestial, fiend, or undead within 60 feet of you that is not behind total cover. You know the type (celestial, fiend, or undead) of any being whose presence you sense, but not its identity (the vampire Count Strahd von Zarovich, for instance). Within the same radius, you also detect the presence of any place or object that has been consecrated or desecrated, as with the Hallow spell.\n\nYou can use this feature a number of times equal to 1 + your Charisma modifier. When you finish a long rest, you regain all expended uses."
                },
                {
                    "name" : "Lay on Hands",
                    "level" : 1,
                    "desc" : "Your blessed touch can heal wounds. You have a pool of healing power that replenishes when you take a long rest. With that pool, you can restore a total number of hit points equal to your paladin level x 5.\n\nAs an action, you can touch a creature and draw power from the pool to restore a number of hit points to that creature, up to the maximum amount remaining in your pool.\n\nAlternatively, you can expend 5 hit points from your pool of healing to cure the target of one disease or neutralize one poison affecting it. You can cure multiple diseases and neutralize multiple poisons with a single use of Lay on Hands, expending hit points separately for each one.\n\nThis feature has no effect on undead and constructs"
                },
                {
                    "name" : "Fighting Style",
                    "level" : 2,
                    "desc" : "Starting at 2nd level, you adopt a particular style of fighting as your specialty. Choose one of the following options. You can't take a Fighting Style option more than once, even if you later get to choose again.",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "Blessed Warrior",
                            "desc" : "You learn two cantrips of your choice from the cleric spell list. They count as paladin spells for you, and Charisma is your spellcasting ability for them. Whenever you gain a level in this class, you can replace one of these cantrips with another cantrip from the cleric spell list.",
                            "comment" : "TODO"
                        },
                        {
                            "name" : "Blind Fighting",
                            "desc" : "You have blindsight with a range of 10 feet. Within that range, you can effectively see anything that isn't behind total cover, even if you're blinded or in darkness. Moreover, you can see an invisible creature within that range, unless the creature successfully hides from you."
                        },
                        {
                            "name" : "Defense",
                            "desc" : "While you are wearing armor, you gain a +1 bonus to AC.",
                            "ac_bonus" : 1,
                            "comment" : "TODO defense"
                        },
                        {
                            "name" : "Dueling",
                            "desc" : "When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon."
                        },
                        {
                            "name" : "Great Weapon Fighting",
                            "desc" : "When you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2. The weapon must have the two-handed or versatile property for you to gain this benefit."
                        },
                        {
                            "name" : "Interception",
                            "desc" : "When a creature you can see hits a target, other than you, within 5 feet of you with an attack, you can use your reaction to reduce the damage the target takes by 1d10 + your proficiency bonus (to a minimum of 0 damage). You must be wielding a shield or a simple or martial weapon to use this reaction."
                        },
                        {
                            "name" : "Protection",
                            "desc" : "When a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield."
                        }
                    ]
                },
                {
                    "name" : "Divine Smite",
                    "desc" : "Starting at 2nd level, when you hit a creature with a melee weapon attack, you can expend one spell slot to deal radiant damage to the target, in addition to the weapon's damage. The extra damage is 2d8 for a 1st-level spell slot, plus 1d8 for each spell level higher than 1st, to a maximum of 5d8. The damage increases by 1d8 if the target is an undead or a fiend, to a maximum of 6d8.",
                    "level" : 2
                },
                {
                    "name" : "Divine Health",
                    "desc" : "By 3rd level, the divine magic flowing through you makes you immune to disease.",
                    "level" : 3
                },
                {
                    "name" : "Harness Divine Power (Optional)",
                    "level" : 3,
                    "desc" : "At 3rd level, you can expend a use of your Channel Divinity to fuel your spells. As a bonus action, you touch your holy symbol, utter a prayer, and regain one expended spell slot, the level of which can be no higher than half your proficiency bonus (rounded up). The number of times you can use this feature is based on the level you've reached in this class: 3rd level, once; 7th level, twice; and 15th level, thrice. You regain all expended uses when you finish a long rest."
                },
                {
                    "name" : "Extra Attack",
                    "level" : 5,
                    "desc" : "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
                },
                {
                    "name" : "Aura of Protection",
                    "level" : 6,
                    "desc" : "Starting at 6th level, whenever you or a friendly creature within 10 feet of you must make a saving throw, the creature gains a bonus to the saving throw equal to your Charisma modifier (with a minimum bonus of +1). You must be conscious to grant this bonus.\n\nAt 18th level, the range of this aura increases to 30 feet."
                },
                {
                    "name" : "Aura of Courage",
                    "level" : 10,
                    "desc" : "Starting at 10th level, you and friendly creatures within 10 feet of you can't be frightened while you are conscious.\n\nAt 18th level, the range of this aura increases to 30 feet."
                },
                {
                    "name" : "Improved Divine Smite",
                    "desc" : "By 11th level, you are so suffused with righteous might that all your melee weapon strikes carry divine power with them. Whenever you hit a creature with a melee weapon, the creature takes an extra 1d8 radiant damage.",
                    "level" : 11
                },
                {
                    "name" : "Cleansing Touch",
                    "level" : 14,
                    "desc" : "Beginning at 14th level, you can use your action to end one spell on yourself or on one willing creature that you touch.\n\nYou can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain expended uses when you finish a long rest."
                }
            ]
        },
        {
            "name" : "Ranger",
            "starting_gold_d4s" : 5,
            "subclass_level" : 3,
            "hit_die" : 10,
            "proficiencies_choices" : [
                {
                    "name" : "Choose three from Animal Handling, Athletics, Insight, Investigation, Nature, Perception, Stealth, and Survival",
                    "choose" : 3,
                    "from" : [
                        { "name" : "Animal Handling"},
                        { "name" : "Athletics"},
                        { "name" : "Insight"},
                        { "name" : "Investigation"},
                        { "name" : "Nature"},
                        { "name" : "Perception"},
                        { "name" : "Stealth"},
                        { "name" : "Survival"}
                    ]
                }
            ],
            "proficiencies": [
                {
                    "name" : "Light armor"
                },
                {
                    "name" : "Medium armor"
                },
                {
                    "name" : "Shields"
                },
                {
                    "name" : "Simple weapons"
                },
                {
                    "name" : "Martial weapons"
                },
                {
                    "name": "Saving throw (Strength)"
                },
                {
                    "name": "Saving throw (Dexterity)"
                }
            ],
            "spell_casting" : {
                "type": 0.5,
                "casting_ability" : "Wis",
                "preparation_mod_multiplier": 0.5,
                "spells_known" : [
                    0, 2, 3, 3, 4, 4, 5, 5, 6, 6, 7, 7, 8, 8, 9, 9, 10, 10, 11, 11
                ],
                "spell_slots" : [
                    [],
                    [2],
                    [3],
                    [3],
                    [4, 2],
                    [4, 2],
                    [4, 3],
                    [4, 3],
                    [4, 3, 2],
                    [4, 3, 2],
                    [4, 3, 3],
                    [4, 3, 3],
                    [4, 3, 3, 1],
                    [4, 3, 3, 1],
                    [4, 3, 3, 2],
                    [4, 3, 3, 2],
                    [4, 3, 3, 3, 1],
                    [4, 3, 3, 3, 1],
                    [4, 3, 3, 3, 2],
                    [4, 3, 3, 3, 2]
                ]
            },
            "equipment" : [
                {
                    "name" : "Scale mail or leather armor",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "Scale mail",
                            "index" : "scale mail"
                        },
                        {
                            "name": "Leather armor",
                            "index" : "leather armor"
                        }
                    ]
                },
                {
                    "name" : "Two shortswords or two simple melee weapons",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "Two shortswords",
                            "comment" : "TODO"
                        },
                        {
                            "name" : "two simple melee weapons",
                            "comment" : "TODO"
                        }
                    ]
                },
                {
                    "name" : "A dungeoneer's pack or an explorer's pack",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "A dungeoneer's pack"
                        },
                        {
                            "name" : "An explorer's pack"
                        }
                    ]
                },
                {
                    "name" : "A longbow",
                    "index" : "longbow"
                },
                {
                    "name" : "A quiver of 20 arrows"
                }
            ],
            "subclasses" : [

            ],
            "features" : [
                {
                    "name" : "Favored Enemy",
                    "comment" : "TODO Favored Foe",
                    "level" : 1,
                    "desc" : "Beginning at 1st level, you have significant experience studying, tracking, hunting, and even talking to a certain type of enemy.\n\nChoose a type of favored enemy: aberrations, beasts, celestials, constructs, dragons, elementals, fey, fiends, giants, monstrosities, oozes, plants, or undead. Alternatively, you can select two races of humanoid (such as gnolls and orcs) as favored enemies.\n\nYou have advantage on Wisdom (Survival) checks to track your favored enemies, as well as on Intelligence checks to recall information about them.\n\nWhen you gain this feature, you also learn one language of your choice that is spoken by your favored enemies, if they speak one at all.\n\nYou choose one additional favored enemy, as well as an associated language, at 6th and 14th level. As you gain levels, your choices should reflect the types of monsters you have encountered on your adventures.",
                    "choose" : 1,
                    "from" : [
                        {"name" : "Aberrations"},
                        {"name" : "Beasts"},
                        {"name" : "Celestials"},
                        {"name" : "Constructs"},
                        {"name" : "Dragons"},
                        {"name" : "Elementals"},
                        {"name" : "Fey"},
                        {"name" : "Fiends"},
                        {"name" : "Giants"},
                        {"name" : "Monstrosities"},
                        {"name" : "Oozes"},
                        {"name" : "Plants"},
                        {"name" : "Undead"}
                    ]
                },
                {
                    "name" : "Natural Explorer",
                    "level" : 1,
                    "comment" : "TODO Deft Explorer (Optional)",
                    "desc" : "At 1st level, you are particularly familiar with one type of natural environment and are adept at traveling and surviving in such regions. Choose one type of favored terrain: arctic, coast, desert, forest, grassland, mountain, swamp, or the Underdark. When you make an Intelligence or Wisdom check related to your favored terrain, your proficiency bonus is doubled if you are using a skill that you’re proficient in.\n\nWhile traveling for an hour or more in your favored terrain, you gain the following benefits:\n\n    Difficult terrain doesn’t slow your group’s travel.\n    Your group can’t become lost except by magical means.\n    Even when you are engaged in another activity while traveling (such as foraging, navigating, or tracking), you remain alert to danger.\n    If you are traveling alone, you can move stealthily at a normal pace.\n    When you forage, you find twice as much food as you normally would.\n    While tracking other creatures, you also learn their exact number, their sizes, and how long ago they passed through the area.\n\nYou choose additional favored terrain types at 6th and 10th level."
                },
                {
                    "name": "Fighting Style",
                    "desc" : "At 2nd level, you adopt a particular style of fighting as your specialty. Choose one of the following options. You can't take a Fighting Style option more than once, even if you later get to choose again.",
                    "Comment" : "TODO"
                },
                {
                    "name" : "Primeval Awareness",
                    "TODO" : "Primal Awareness (Optional)",
                    "level" : 3,
                    "desc" : "Beginning at 3rd level, you can use your action and expend one ranger spell slot to focus your awareness on the region around you. For 1 minute per level of the spell slot you expend, you can sense whether the following types of creatures are present within 1 mile of you (or within up to 6 miles if you are in your favored terrain): aberrations, celestials, dragons, elementals, fey, fiends, and undead. This feature doesn’t reveal the creatures’ location or number."
                },
                {
                    "name" : "Extra Attack",
                    "level" : 5,
                    "desc" : "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
                },
                {
                    "name" : "Land's Stride",
                    "level" : 8,
                    "desc" : "Starting at 8th level, moving through nonmagical difficult terrain costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard.\n\nIn addition, you have advantage on saving throws against plants that are magically created or manipulated to impede movement, such those created by the Entangle spell."
                },
                {
                    "name" : "Hide in Plain Sight",
                    "comment" : "TODO Nature's Veil (Optional)",
                    "level" : 10,
                    "desc" : "Starting at 10th level, you can spend 1 minute creating camouflage for yourself. You must have access to fresh mud, dirt, plants, soot, and other naturally occurring materials with which to create your camouflage.\n\nOnce you are camouflaged in this way, you can try to hide by pressing yourself up against a solid surface, such as a tree or wall, that is at least as tall and wide as you are. You gain a +10 bonus to Dexterity (Stealth) checks as long as you remain there without moving or taking actions. Once you move or take an action or a reaction, you must camouflage yourself again to gain this benefit."
                },
                {
                    "name" : "Vanish",
                    "level" : 14,
                    "desc" : "Starting at 14th level, you can use the Hide action as a bonus action on your turn. Also, you can't be tracked by nonmagical means, unless you choose to leave a trail."
                },
                {
                    "name" : "Feral Senses",
                    "level" : 16,
                    "desc" : "At 18th level, you gain preternatural senses that help you fight creatures you can't see. When you attack a creature you can't see, your inability to see it doesn't impose disadvantage on your attack rolls against it.\n\nYou are also aware of the location of any invisible creature within 30 feet of you, provided that the creature isn't hidden from you and you aren't blinded or deafened."
                },
                {
                    "name" : "Foe Slayer",
                    "level" : 20,
                    "desc" : "At 20th level, you become an unparalleled hunter of your enemies. Once on each of your turns, you can add your Wisdom modifier to the attack roll or the damage roll of an attack you make against one of your favored enemies. You can choose to use this feature before or after the roll, but before any effects of the roll are applied."
                }
            ]
        },
        {
            "name" : "Rogue",
            "starting_gold_d4s" : 5,
            "subclass_level" : 3,
            "hit_die" : 8,
            "spell_casting" : {
                "type" : 0.0
            },
            "proficiencies_choices" : [
                {
                    "name" : "Choose four from Acrobatics, Athletics, Deception, Insight, Intimidation, Investigation, Perception, Performance, Persuasion, Sleight of Hand, and Stealth",
                    "choose" : 4,
                    "from" : [
                        { "name" : "Acrobatics"},
                        { "name" : "Athletics"},
                        { "name" : "Deception"},
                        { "name" : "Insight"},
                        { "name" : "Intimidation"},
                        { "name" : "Investigation"},
                        { "name" : "Perception"},
                        { "name" : "Performance"},
                        { "name" : "Persuasion"},
                        { "name" : "Sleight of Hand"},
                        { "name" : "Stealth of Hand"}
                    ]
                }
            ],
            "proficiencies": [
                {
                    "name" : "Light armor"
                },
                {
                    "name" : "Simple weapons"
                },
                {
                    "name" : "Thieves' tools"
                },
                {
                    "name" : "Hand crossbows",
                    "index" : "hand crossbow"
                },
                {
                    "name" : "Longswords",
                    "index" : "longswords"
                },
                {
                    "name" : "Shortswords",
                    "index" : "shortsword"
                },
                {
                    "name" : "Rapiers",
                    "index" : "rapier"
                },
                {
                    "name": "Saving throw (Dexterity)"
                },
                {
                    "name": "Saving throw (Intelligence)"
                }
            ],
            "equipment" : [
                {
                    "name" : "A rapier or a shortsword",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "Rapier",
                            "index" : "rapier"
                        },
                        {
                            "name": "Shortsword",
                            "index": "shortsword"
                        }
                    ]
                },
                {
                    "name" : "A shortbow and quiver of 20 arrows or a shortsword",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "A shortbow and quiver of 20 arrows",
                            "comment" : "TODO"
                        },
                        {
                            "name" : "Shortsword",
                            "index" : "shortsword"
                        }
                    ]
                },
                {
                    "name" : "A burglar's pack, a dungeoneer's pack, or an explorer's pack",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "A burglar's pack"
                        },
                        {
                            "name" : "A dungeoneer's pack"
                        },
                        {
                            "name" : "An explorer's pack"
                        }
                    ]
                },
                {
                    "name" : "Leather armor"
                },
                {
                    "name" : "Dagger"
                },
                {
                    "name" : "Dagger"
                },
                {
                    "name" : "Thieves' tools"
                }
            ],
            "subclasses" : [

            ],
            "features" : [
                {
                    "name": "Expertise",
                    "desc": "At 1st level, choose two of your skill proficiencies. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies.",
                    "level": 1,
                    "choose": 2,
                    "from": [
                        {
                            "index": "proficiencies"
                        }
                    ]
                },
                {
                    "name" : "Sneak Attack",
                    "desc" : "Beginning at 1st level, you know how to strike subtly and exploit a foe's distraction. Once per turn, you can deal an extra 1d6 damage to one creature you hit with an attack if you have advantage on the attack roll. The attack must use a finesse or a ranged weapon.\n\nYou don't need advantage on the attack roll if another enemy of the target is within 5 feet of it, that enemy isn't incapacitated, and you don't have disadvantage on the attack roll.\n\nThe amount of the extra damage increases as you gain levels in this class, as shown in the Sneak Attack column of the Rogue table.",
                    "level" : 1
                },
                {
                    "name" : "Thieves' Cant",
                    "desc" : "During your rogue training you learned thieves' cant, a secret mix of dialect, jargon, and code that allows you to hide messages in seemingly normal conversation. Only another creature that knows thieves' cant understands such messages. It takes four times longer to convey such a message than it does to speak the same idea plainly.\n\nIn addition, you understand a set of secret signs and symbols used to convey short, simple messages, such as whether an area is dangerous or the territory of a thieves' guild, whether loot is nearby, or whether the people in an area are easy marks or will provide a safe house for thieves on the run.",
                    "level" : 1
                },
                {
                    "name" : "Cunning Action",
                    "level" : 2,
                    "desc" : "Starting at 2nd level, your quick thinking and agility allow you to move and act quickly. You can take a bonus action on each of your turns in combat. This action can be used only to take the Dash, Disengage, or Hide action."
                },
                {
                    "name" : "Steady Aim (Optional)",
                    "level" : 3,
                    "desc" : "At 3rd level, as a bonus action, you give yourself advantage on your next attack roll on the current turn. You can use this bonus action only if you haven't moved during this turn, and after you use the bonus action, your speed is 0 until the end of the current turn."
                },
                {
                    "name" : "Uncanny Dodge",
                    "level" : 5,
                    "desc" : "Starting at 5th level, when an attacker that you can see hits you with an attack, you can use your reaction to halve the attack's damage against you."
                },
                {
                    "name" : "Evasion",
                    "level" : 7,
                    "desc" : "Beginning at 7th level, you can nimbly dodge out of the way of certain area effects, such as a red dragon's fiery breath or an Ice Storm spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail."
                },
                {
                    "name" : "Reliable Talent",
                    "level" : 11,
                    "desc" : "By 11th level, you have refined your chosen skills until they approach perfection. Whenever you make an ability check that lets you add your proficiency bonus, you can treat a d20 roll of 9 or lower as a 10."
                },
                {
                    "name" : "Blindsense",
                    "level" : 14,
                    "desc" : "Starting at 14th level, if you are able to hear, you are aware of the location of any hidden or invisible creature within 10 feet of you."
                },
                {
                    "name" : "Slippery Mind",
                    "desc" : "By 15th level, you have acquired greater mental strength. You gain proficiency in Wisdom saving throws.",
                    "level" : 15,
                    "comment" : "TODO"
                },
                {
                    "name" : "Elusive",
                    "desc" : "Beginning at 18th level, you are so evasive that attackers rarely gain the upper hand against you. No attack roll has advantage against you while you aren't incapacitated.",
                    "level" : 18
                },
                {
                    "name" : "Stroke of Luck",
                    "desc" : "At 20th level, you have an uncanny knack for succeeding when you need to. If your attack misses a target within range, you can turn the miss into a hit. Alternatively, if you fail an ability check, you can treat the d20 roll as a 20.\n\nOnce you use this feature, you can't use it again until you finish a short or long rest.",
                    "level" : 20
                }

            ]
        },
        {
            "name" : "Sorcerer",
            "starting_gold_d4s" : 3,
            "subclass_level" : 1,
            "hit_die" : 6,
            "spell_casting" : {
                "type" : 1.0,
                "casting_ability" : "Char",
                "cantrips_known" : [
                    4, 4, 4, 5, 5, 5, 5, 5, 5, 6, 6, 6, 6,6 ,6,6,6,6,6,6
                ],
                "spells_known" : [
                    2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 13, 14, 14, 15, 15, 15, 15
                ],
                "spell_slots" : [
                    [2],
                    [3],
                    [4, 2],
                    [4, 3],
                    [4, 3, 2],
                    [4, 3, 3],
                    [4, 3, 3, 1],
                    [4, 3, 3, 2],
                    [4, 3, 3, 3, 1],
                    [4, 3, 3, 3, 2],
                    [4, 3, 3, 3, 2, 1],
                    [4, 3, 3, 3, 2, 1],
                    [4, 3, 3, 3, 2, 1, 1],
                    [4, 3, 3, 3, 2, 1, 1],
                    [4, 3, 3, 3, 2, 1, 1, 1],
                    [4, 3, 3, 3, 2, 1, 1, 1],
                    [4, 3, 3, 3, 2, 1, 1, 1, 1],
                    [4, 3, 3, 3, 2, 1, 1, 1, 1],
                    [4, 3, 3, 3, 3, 1, 1, 1, 1],
                    [4, 3, 3, 3, 3, 2, 1, 1, 1],
                    [4, 3, 3, 3, 3, 2, 2, 1, 1]
                ]
            },
            "proficiency_choices": [
                {
                    "name": "Choose two from Arcana, Deception, Insight, Intimidation, Persuasion, and Religion",
                    "choose": 2,
                    "from": [
                        {
                            "name": "Arcana"
                        },
                        {
                            "name": "Deception"
                        },
                        {
                            "name": "Investigation"
                        },
                        {
                            "name": "Insight"
                        },
                        {
                            "name": "Intimidation"
                        },
                        {
                            "name": "Persuasion"
                        },
                        {
                            "name": "Religion"
                        }
                    ]
                }
            ],
            "proficiencies": [
                {
                    "name" : "Daggers",
                    "index" : "dagger"
                },
                {
                    "name" : "Darts",
                    "index" : "dart"
                },
                {
                    "name" : "Slings",
                    "index" : "sling"
                },
                {
                    "name" : "Quarterstaffs",
                    "index" : "quarterstaff"
                },
                {
                    "name" : "Light crossbows",
                    "index" : "light crossbow"
                },
                {
                    "name": "Saving throw (Constitution)"
                },
                {
                    "name": "Saving throw (Charisma)"
                }
            ],
            "equipment" : [
                {
                    "name" : "A light crossbow and 20 bolts or any simple weapon",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "A light crossbow and 20 bolts",
                            "comment" : "TODO"
                        },
                        {
                            "index" : "simple_weapons"
                        }
                    ]
                },
                {
                    "name" : "A component pouch or an arcane focus",
                    "choose" : 1,
                    "from" : [
                        {
                            "index" : "component pouch"
                        },
                        {
                            "index" : "arcane focus"
                        }
                    ]
                },
                {
                    "name" : "A dungeoneer's pack or an explorer's pack",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "A dungeoneer's pack"
                        },
                        {
                            "name" : "An explorer's pack"
                        }
                    ]
                },
                {
                    "index" : "dagger"
                },
                {
                    "index" : "dagger"
                }
            ],
            "subclasses" : [

            ],
            "features" : [
                {
                    "name" : "Font of Magic",
                    "level" : 2,
                    "desc" : "At 2nd level, you tap into a deep wellspring of magic within yourself. This wellspring is represented by sorcery points, which allow you to create a variety of magical effects.\n\n    Sorcery Points. You have 2 sorcery points, and you gain more as you reach higher levels, as shown in the Sorcery Points column of the Sorcerer table. You can never have more sorcery points than shown on the table for your level. You regain all spent sorcery points when you finish a long rest.\n\n    Flexible Casting. You can use your sorcery points to gain additional spell slots, or sacrifice spell slots to gain additional sorcery points. You learn other ways to use your sorcery points as you reach higher levels.\n        Creating Spell Slots. You can transform unexpended sorcery points into one spell slot as a bonus action on your turn. The Creating Spell Slots table shows the cost of creating a spell slot of a given level. You can create spell slots no higher in level than 5th. Any spell slot you create with this feature vanishes when you finish a long rest.\n        Converting a Spell Slot to Sorcery Points. As a bonus action on your turn, you can expend one spell slot and gain a number of sorcery points equal to the slot's level.",
                    "comment" : "TODO add the table",
                    "comment1" : "TODO a resource"
                },
                {
                    "name" : "Metamagic",
                    "level" : 3,
                    "desc" : "At 3rd level, you gain the ability to twist your spells to suit your needs. You gain two of the following Metamagic options of your choice. You gain another one at 10th and 17th level.\n\nYou can use only one Metamagic option on a spell when you cast it, unless otherwise noted.",
                    "choose" : 2,
                    "from" : [
                        {
                            "index" : "metamagic"
                        }
                    ]
                },
                {
                    "name" : "Magical Guidance (Optional)",
                    "desc" : "When you reach 5th level, you can tap into your inner wellspring of magic to try and conjure success from failure. When you make an ability check that fails, you can spend 1 sorcery point to reroll the d20, and you must use the new roll, potentially turning the failure into a success.",
                    "level" : 5
                },
                {
                    "name" : "Sorcerous Restoration",
                    "desc" : "At 20th level, you regain 4 expended sorcery points whenever you finish a short rest.",
                    "level" : 20,
                    "comment" : "TODO impl"
                }
            ]
        },
        {
            "name" : "Warlock",
            "starting_gold_d4s" : 4,
            "subclass_level" : 1,
            "hit_die" : 8,
            "pact_magic" : {
                "casting_ability" : "Cha",
                "cantrips_known" : [
                    2, 2, 2, 3, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4
                ],
                "spells_known" : [
                    2, 3, 4, 5, 6, 7, 8, 9, 10, 10, 11, 11, 12, 12, 13, 13, 14, 14, 15, 15
                ],
                "pact_slots" : [
                    {"level" : 1, "amount" : 1},
                    {"level" : 1, "amount" : 2},
                    {"level" : 2, "amount" : 2},
                    {"level" : 2, "amount" : 2},
                    {"level" : 3, "amount" : 2},
                    {"level" : 3, "amount" : 2},
                    {"level" : 4, "amount" : 2},
                    {"level" : 4, "amount" : 2},
                    {"level" : 5, "amount" : 2},
                    {"level" : 5, "amount" : 2},
                    {"level" : 5, "amount" : 3},
                    {"level" : 5, "amount" : 3},
                    {"level" : 5, "amount" : 3},
                    {"level" : 5, "amount" : 3},
                    {"level" : 5, "amount" : 3},
                    {"level" : 5, "amount" : 3},
                    {"level" : 5, "amount" : 4},
                    {"level" : 5, "amount" : 4},
                    {"level" : 5, "amount" : 4},
                    {"level" : 5, "amount" : 4}
                ]
            },
            "spell_casting" : {"type" : 0.0},
            "comment" : "TODO add pact magic",
            "proficiency_choices": [
                {
                    "name": "Choose two from Arcana, Deception, History, Intimidation, Investigation, Nature, and Religion.",
                    "choose": 2,
                    "from": [
                        {
                            "name": "Arcana"
                        },
                        {
                            "name": "Deception"
                        },
                        {
                            "name": "History"
                        },
                        {
                            "name": "Intimidation"
                        },
                        {
                            "name": "Investigation"
                        },
                        {
                            "name": "Nature"
                        },
                        {
                            "name": "Religion"
                        }
                    ]
                }
            ],
            "proficiencies": [
                {
                    "name" : "Light armor"
                },
                {
                    "name" : "Simple weapons"
                },
                {
                    "name": "Saving throw (Wisdom)"
                },
                {
                    "name": "Saving throw (Charisma)"
                }
            ],
            "equipment" : [
                {
                    "name" : "A light crossbow and 20 bolts or any simple weapon",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "A light crossbow and 20 bolts",
                            "comment" : "TODO fix"
                        },
                        {
                            "index" : "simple_weapons"
                        }
                    ]
                },
                {
                    "name" : "A component pouch or an arcane focus",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "A component pouch"
                        },
                        {
                            "name" : "An arcane focus"
                        }
                    ]
                },
                {
                    "name" : "A scholar's pack or a dungeoneer's pack",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "A scholar's pack"
                        },
                        {
                            "name" : "A dungeoneer's pack"
                        }
                    ]
                },
                {
                    "index" : "Leather armor"
                },
                {
                    "name" : "Any simple weapon",
                    "choose" : 1,
                    "from" : [
                        {
                            "index" : "simple_weapons"
                        }
                    ]
                },
                {
                    "index" : "dagger"
                },
                {
                    "index" : "dagger"
                }
            ],
            "subclasses" : [

            ],
            "features" : [
                {
                    "name" : "Eldritch Invocations",
                    "level" : 2,
                    "desc" : "In your study of occult lore, you have unearthed Eldritch Invocations, fragments of forbidden knowledge that imbue you with an abiding magical ability.\n\nAt 2nd level, you gain two eldritch invocations of your choice. When you gain certain warlock levels, you gain additional invocations of your choice, as shown in the Invocations Known column of the Warlock table. A level prerequisite refers to your level in this class.\n\nAdditionally, when you gain a level in this class, you can choose one of the invocations you know and replace it with another invocation that you could learn at that level.",
                    "choose" : [
                        0, 2, 2, 2, 3, 3, 4, 4, 5, 5, 5, 6, 6, 6, 7, 7, 7, 8, 8, 8
                    ],
                    "from" : [
                        {
                            "index" : "invocations"
                        }
                    ]
                },
                {
                    "name" : "Pact Boon",
                    "desc" : "At 3rd level, your otherworldly patron bestows a gift upon you for your loyal service. You gain one of the following features of your choice.",
                    "level" : 3,
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "Pact of the Blade",
                            "desc" : "You can use your action to create a pact weapon in your empty hand. You can choose the form that this melee weapon takes each time you create it. You are proficient with it while you wield it. This weapon counts as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage.\n    Your pact weapon disappears if it is more than 5 feet away from you for 1 minute or more. It also disappears if you use this feature again, if you dismiss the weapon (no action required), or if you die.\n    You can transform one magic weapon into your pact weapon by performing a special ritual while you hold the weapon. You perform the ritual over the course of 1 hour, which can be done during a short rest.\n    You can then dismiss the weapon, shunting it into an extradimensional space, and it appears whenever you create your pact weapon thereafter. You can't affect an artifact or a sentient weapon in this way. The weapon ceases being your pact weapon if you die, if you perform the 1-hour ritual on a different weapon, or if you use a 1-hour ritual to break your bond to it. The weapon appears at your feet if it is in the extradimensional space when the bond breaks."
                        },
                        {
                            "name" : "Pact of the Chain",
                            "desc" : "You learn the Find Familiar spell and can cast it as a ritual. The spell doesn't count against your number of spells known.\n    When you cast the spell, you can choose one of the normal forms for your familiar or one of the following special forms: imp, pseudodragon, quasit, or sprite.\n    Additionally, when you take the Attack action, you can forgo one of your own attacks to allow your familiar to use its reaction to make one attack with its reaction.",
                            "spells" : [
                                {"index" : "Find Familiar"}
                            ]
                        },
                        {
                            "name" : "Pact of the Tome",
                            "desc" : "Your patron gives you a grimoire called a Book of Shadows. When you gain this feature, choose three cantrips from any class's spell list (the three needn't be from the same list). While the book is on your person, you can cast those cantrips at will. They don't count against your number of cantrips known. If they don't appear on the warlock spell list, they are nonetheless warlock spells for you.\n    If you lose your Book of Shadows, you can perform a 1-hour ceremony to receive a replacement from your patron. This ceremony can be performed during a short or long rest, and it destroys the previous book. The book turns to ash when you die.",
                            "comment" : "add the spells"
                        },
                        {
                            "name" : "Pact of the Talisman",
                            "desc" : "Your patron gives you an amulet, a talisman that can aid the wearer when the need is great. When the wearer fails an ability check, they can add a d4 to the roll, potentially turning the roll into a success. This benefit can be used a number of times equal to your proficiency bonus, and all expended uses are restored when you finish a long rest.\n    If you lose the talisman, you can perform a 1-hour ceremony to receive a replacement from your patron. This ceremony can be performed during a short or long rest, and it destroys the previous amulet. The talisman turns to ash when you die."
                        }
                    ]
                },
                {
                    "name" : "Mystic Arcanum",
                    "level" : 11,
                    "desc" : "At 11th level, your patron bestows upon you a magical secret called an arcanum. Choose one 6th-level spell from the warlock spell list as this arcanum.\n\nYou can cast your arcanum spell once without expending a spell slot. You must finish a long rest before you can do so again.\n\nAt higher levels, you gain more warlock spells of your choice that can be cast in this way: one 7th-level spell at 13th level, one 8th-level spell at 15th level, and one 9th-level spell at 17th level. You regain all uses of your Mystic Arcanum when you finish a long rest."
                },
                {
                    "name" : "Eldritch Master",
                    "level" : 20,
                    "desc" : "At 20th level, you can draw on your inner reserve of mystical power while entreating your patron to regain expended spell slots. You can spend 1 minute entreating your patron for aid to regain all your expended spell slots from your Pact Magic feature. Once you regain spell slots with this feature, you must finish a long rest before you can do so again."
                }
            ]
        },
        {
            "name" : "Wizard",
            "starting_gold_d4s" : 4,
            "subclass_level" : 2,
            "hit_die" : 6,
            "spell_casting" : {
                "type" : 1.0,
                "casting_ability" : "Int",
                "cantrips_known" : [
                    3, 3, 3, 4, 4, 4, 4, 4, 4, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5
                ],
                "prepare_from" : "known",
                "comment" : "Implement spell book",
                "spell_slots" : [
                    [2],
                    [3],
                    [4, 2],
                    [4, 3],
                    [4, 3, 2],
                    [4, 3, 3],
                    [4, 3, 3, 1],
                    [4, 3, 3, 2],
                    [4, 3, 3, 3, 1],
                    [4, 3, 3, 3, 2],
                    [4, 3, 3, 3, 2, 1],
                    [4, 3, 3, 3, 2, 1],
                    [4, 3, 3, 3, 2, 1, 1],
                    [4, 3, 3, 3, 2, 1, 1],
                    [4, 3, 3, 3, 2, 1, 1, 1],
                    [4, 3, 3, 3, 2, 1, 1, 1],
                    [4, 3, 3, 3, 2, 1, 1, 1],
                    [4, 3, 3, 3, 2, 1, 1, 1, 1],
                    [4, 3, 3, 3, 3, 1, 1, 1, 1],
                    [4, 3, 3, 3, 3, 2, 1, 1, 1],
                    [4, 3, 3, 3, 3, 2, 2, 1, 1]
                ]
            },
            "proficiency_choices": [
                {
                    "name": "Choose two from Arcana, History, Insight, Investigation, Medicine, and Religion",
                    "choose": 2,
                    "from": [
                        {
                            "name": "Arcana"
                        },
                        {
                            "name": "History"
                        },
                        {
                            "name": "Insight"
                        },
                        {
                            "name": "Investigation"
                        },
                        {
                            "name": "Medicine"
                        },
                        {
                            "name": "Religion"
                        }
                    ]
                }
            ],
            "proficiencies": [
                {
                    "name" : "Daggers",
                    "index" : "dagger"
                },
                {
                    "name" : "Darts",
                    "index" : "dart"
                },
                {
                    "name" : "Slings",
                    "index" : "sling"
                },
                {
                    "name" : "Quarterstaffs",
                    "index" : "quarterstaff"
                },
                {
                    "name" : "Light crossbows",
                    "index" : "light crossbow"
                },
                {
                    "name": "Saving throw (Intelligence)"
                },
                {
                    "name": "Saving throw (Wisdom)"
                }
            ],
            "equipment" : [
                {
                    "name" : "A quarterstaff or a dagger",
                    "choose" : 1,
                    "from" : [
                        {
                            "index": "quarterstaff"
                        },
                        {
                            "index" : "dagger"
                        }
                    ]
                },
                {
                    "name" : "A component pouch or an arcane focus",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "A component pouch"
                        },
                        {
                            "name" : "An arcane focus"
                        }
                    ]
                },
                {
                    "name" : "A scholar's pack or an explorer's pack",
                    "choose" : 1,
                    "from" : [
                        {
                            "name" : "A scholar's pack"
                        },
                        {
                            "name" : "An explorer's pack"
                        }
                    ]
                }
            ],
            "subclasses" : [

            ],
            "features" : [
                {
                    "name" : "Arcane Recovery",
                    "level" : 1,
                    "desc" : "You have learned to regain some of your magical energy by studying your spellbook. Once per day when you finish a short rest, you can choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your wizard level (rounded up), and none of the slots can be 6th level or higher.\n\nFor example, if you're a 4th-level wizard, you can recover up to two levels worth of spell slots. You can recover either a 2nd-level spell slot or two 1st-level spell slots.",
                    "comment" : "TODO impl"
                },
                {
                    "name" : "Cantrip Formulas (Optional)",
                    "level" : 3,
                    "desc" : "At 3rd level, you have scribed a set of arcane formulas in your spellbook that you can use to formulate a cantrip in your mind. Whenever you finish a long rest and consult those formulas in your spellbook, you can replace one wizard cantrip you know with another cantrip from the wizard spell list."
                },
                {
                    "name" : "Spell Mastery",
                    "level" : 18,
                    "desc" : "At 18th level, you have achieved such mastery over certain spells that you can cast them at will. Choose a 1st-level wizard spell and a 2nd-level wizard spell that are in your spellbook. You can cast those spells at their lowest level without expending a spell slot when you have them prepared. If you want to cast either spell at a higher level, you must expend a spell slot as normal.\n\nBy spending 8 hours in study, you can exchange one or both of the spells you chose for different spells of the same levels."
                },
                {
                    "name" : "Signature Spells",
                    "level" : 20,
                    "desc" : "When you reach 20th level, you gain mastery over two powerful spells and can cast them with little effort. Choose two 3rd-level wizard spells in your spellbook as your signature spells. You always have these spells prepared, they don't count against the number of spells you have prepared, and you can cast each of them once at 3rd level without expending a spell slot. When you do so, you can't do so again until you finish a short or long rest.\n\nIf you want to cast either spell at a higher level, you must expend a spell slot as normal.",
                    "comment" : "TODO impl"
                }
            ]
        }
    ]
}