{
  "classes": [
    {
      "name": "Artificer",
      "hit_die": 8,
      "proficiency_choices": [
        {
          "name": "Arcana"
        },
        {
          "name": "History"
        },
        {
          "name": "Investigation"
        },
        {
          "name": "Medicine"
        },
        {
          "name": "Nature"
        },
        {
          "name": "Perception"
        },
        {
          "name": "Sleight of Hand"
        }
      ],
      "features": [
        {
          "name": "Magical Tinkering",
          "desc": "At 1st level, you've learned how to invest a spark of magic into mundane objects. To use this ability, you must have thieves' tools or artisan's tools in hand. You then touch a Tiny nonmagical object as an action and give it one of the following magical properties of your choice: The object sheds bright light in a 5-foot radius and dim light for an additional 5 feet. Whenever tapped by a creature, the object emits a recorded message that can be heard up to 10 feet away. You utter the message when you bestow this property on the object, and the recording can be no more than 6 seconds long. The object continuously emits your choice of an odor or a nonverbal sound (wind, waves, chirping, or the like). The chosen phenomenon is perceivable up to 10 feet away. A static visual effect appears on one of the object's surfaces. This effect can be a picture, up to 25 words of text, lines and shapes, or a mixture of these elements, as you like. The chosen property lasts indefinitely. As an action, you can touch the object and end the property early. You can bestow magic on multiple objects, touching one object each time you use this feature, though a single object can only bear one property at a time. The maximum number of objects you can affect with this feature at one time is equal to your Intelligence modifier (minimum of one object). If you try to exceed your maximum, the oldest property immediately ends, and then the new property applies.",
          "level": 1
        },
        {
          "name": "The Right Tool for the Job",
          "desc": "At 3rd level, you've learned how to produce exactly the tool you need: with thieves' tools or artisan's tools in hand, you can magically create one set of artisan's tools in an unoccupied space within 5 feet of you. This creation requires 1 hour of uninterrupted work, which can coincide with a short or long rest. Though the product of magic, the tools are nonmagical, and they vanish when you use this feature again.",
          "level": 3
        },
         {
          "name": "Tool Expertise",
          "desc": "At 6th level, your proficiency bonus is now doubled for any ability check you make that uses your proficiency with a tool.",
          "level": 6
        },
         {
          "name": "Flash of Genius",
          "desc": "At 7th level, you've gained the ability to come up with solutions under pressure. When you or another creature you can see within 30 feet of you makes an ability check or a saving throw, you can use your reaction to add your Intelligence modifier to the roll. You can use this feature a number of times equal to your Intelligence modifier (minimum of once). You regain all expended uses when you finish a long rest.",
          "level": 7
        },
         {
          "name": "Magic Item Adept",
          "desc": "When you reach 10th level, you achieve a profound understanding of how to use and make magic items: You can attune to up to four magic items at once. If you craft a magic item with a rarity of common or uncommon, it takes you a quarter of the normal time, and it costs you half as much of the usual gold. ",
          "level": 10
        },
        {
          "name": "Spell-Storing Item",
          "desc": "At 11th level, you can now store a spell in an object. Whenever you finish a long rest, you can touch one simple or martial weapon or one item that you can use as a spellcasting focus, and you store a spell in it, choosing a lst- or 2nd-level spell from the artificer spell list that requires 1 action to cast (you needn't have it prepared). While holding the object, a creature can take an action to produce the spell's effect from it, using your spellcasting ability modifier. If the spell requires concentration, the creature must concentrate. The spell stays in the object until it's been used a number of times equal to twice your Intelligence modifier (minimum of twice) or until you use this feature again to store a spell in an object.",
          "level": 11
        },
        {
          "name": "Magic Item Savant",
          "desc": "At 14th level, your skill with magic items deepens more: You can attune to up to five magic items at once. You ignore all class, race, spell and level requirements on attuning to or using a magic item.",
          "level": 14
        },
         {
          "name": "Magic Item Master",
          "desc": "At 14th level, your skill with magic items deepens more: You can attune to up to five magic items at once. You ignore all class, race, spell and level requirements on attuning to or using a magic item.",
          "level": 18
        },
         {
          "name": "Soul of Artifice",
          "desc": "At 20th level, you develop a mystical connection to your magic items, which you can draw on for protection: You gain a +1 bonus to all saving throws per magic item you are currently attuned to. If you're reduced to 0 hit points but not killed out-right, you can use your reaction to end one of your artificer infusions, causing you to drop to 1 hit point instead of 0.",
          "level": 20
        }
      ],
      "equipment": [
        {
          "name": "any two simple weapons",
          "choose": 2,
          "options_index": "simple_weapons"
        }
      ],
      "infusions": [
        {
          "name": "Arcane Propulsion Armor",
          "level": 14,
          "desc": "Prerequisite: 14th-level artificer. Item: A suit of armor (requires attunement). The wearer of this armor gains these benefits: The wearer's walking speed increases by 5 feet. The armor includes gauntlets, each of which is a magic melee weapon that can be wielded only when the hand is holding nothing. The wearer is proficient with the gauntlets, and each one deals 1d8 force damage on a hit and has the thrown property, with a normal range of 20 feet and a long range of 60 feet. When thrown, the gauntlet detaches and flies at the attack's target, then immediately returns to the wearer and reattaches. The armor can't be removed against the wearer's will. If the wearer is missing any limbs, the armor replaces those limbs - hands, arms, feet, legs, or similar appendages. The replacements function identically to the body parts they replace.",
          "requires_attunement": 1
        },
          {
          "name": "Armor of Magical Strength",
          "desc": "Item: A suit of armor (requires attunement). This armor has 6 charges. The wearer can expend the armor's charges in the following ways: When the wearer makes a Strength check or a Strength saving throw, it can expend 1 charge to add a bonus to the roll equal to its Intelligence modifier. If the creature would be knocked prone, it can use its reaction to expend 1 charge to avoid being knocked prone. The armor regains 1d6 expended charges daily at dawn.",
          "requires_attunement": 1
        },
        {
          "name": "Armor of Tools (UA)",
          "desc": "Item: A suit of armor. As an action, a creature wearing this infused armor can integrate into it artisan’s tools or thieves’ tools. The tools remain integrated in the armor for 8 hours or until the wearer removes the tools as an action. The armor can have only one tool integrated at a time. The wearer can add its Intelligence modifier to any ability checks it makes with the integrated tool. The wearer must have a hand free to use the tool."
        },
          {
          "name": "Boots of the Winding Path",
          "desc": "Item: A rod, staff or wand (requires attunement). While holding this item, a creature gains +1 bonus to spell attack rolls. In addition, the creature ignores half cover when making a spell attack. The bonus increases to +2 when you reach 10th level in this class.",
          "requires_attunement": 1
        },
       {
          "name": "Enhanced Arcane Focus",
          "desc": "Item: A suit of armor. As an action, a creature wearing this infused armor can integrate into it artisan’s tools or thieves’ tools. The tools remain integrated in the armor for 8 hours or until the wearer removes the tools as an action. The armor can have only one tool integrated at a time. The wearer can add its Intelligence modifier to any ability checks it makes with the integrated tool. The wearer must have a hand free to use the tool."
        }, 
         {
          "name": "Enhanced Defense",
          "desc": "Item: A suit of armor or a shield. A creature gains a +1 bonus to Armor Class while wearing (armor) or wielding (shield) the infused item. The bonus increases to +2 when you reach 10th level in this class."
        },
         {
          "name": "Enhanced Weapon",
          "desc": "Item: A simple or martial weapon. This magic weapon grants a +1 bonus to attack and damage rolls made with it. The bonus increases to +2 when you reach 10th level in this class."
        }, 
         {
          "name": "Helm of Awareness",
          "level": 10,
          "desc": "Prerequisite: 10th-level artificer. Item: A helmet (requires attunement). While wearing this helmet, a creature has advantage on initiative rolls. In addition, the wearer can’t be surprised, provided it isn’t incapacitated.",
          "requires_attunement": 1
        },
        {
          "name": "Mind Sharpener",
          "desc": "Item: A suit of armor or robes. The infused item can send a jolt to the wearer to refocus their mind. The item has 4 charges. When the wearer fails a Constitution saving throw to maintain concentration on a spell, the wearer can use its reaction to expend 1 of the item's charges to succeed instead. The item regains 1d4 expended charges daily at dawn."
        }, 
           {
          "name": "Radiant Weapon",
          "desc": "Prerequisite: 6th-level artificer. Item: A simple or martial weapon (requires attunement). ",
          "level": 6,
          "requires_attunement": 1
        },
         {
          "name": "Repeating Shot",
          "desc": "Item: A simple or martial weapon with the ammunition property (requires attunement). This magic weapon grants a + 1 bonus to attack and damage rolls made with it when it's used to make a ranged attack, and it ignores the loading property if it has it. If you load no ammunition in the weapon, it produces its own, automatically creating one piece of magic ammunition when you make a ranged attack with it. The ammunition created by the weapon vanishes the instant after it hits or misses a target."
        },
        {
          "name": "Replicate Magic Item",
          "desc": "Using this infusion, you replicate a particular magic item. You can learn this infusion multiple times; each time you do so, choose a magic item that you can make with it, picking from the Replicable Items tables. A table's title tells you the level you must be in the class to choose an item from the table. Alternatively, you can choose the magic item from among the common magic items in the game, not including potions or scrolls. In the tables, an item's entry tells you whether the item requires attunement. See the item's description in the Dungeon Master's Guide for more information about it, including the type of object required for its making. If you have Xanathar's Guide to Everything, you can choose from among the common magic items in that book when you pick a magic item you can replicate with this infusion.",
          "choose": 1,
          "from": [
        {
          "name": "Alchemy Jug",
          "requires_attunement": 0,
          "level": 2
        },
        {
          "name": "Bag of Holding",
          "requires_attunement": 0,
          "level": 2
        },  {
          "name": "Cap of Water Breathing",
          "requires_attunement": 0,
          "level": 2
        },  {
          "name": "Goggles of Night",
          "requires_attunement": 0,
          "level": 2
        },  {
          "name": "Rope of Climbing",
          "requires_attunement": 0,
          "level": 2
        },  {
          "name": "Wand of Magic Detection",
          "requires_attunement": 0,
          "level": 2
        },  {
          "name": "Wand of Secrets",
          "requires_attunement": 0,
          "level": 2
        },  
        {
          "name": "Sending Stones",
          "requires_attunement": 0,
          "level": 2
        },
        {
          "name": "Boots of Elvenkind",
          "requires_attunement": 0,
          "level": 6
        },
        {
          "name": "Cloak of Elvenkind",
          "requires_attunement": 1,
          "level": 6
        },
        {
          "name": "Cloak of the Manta Ray",
          "requires_attunement": 0,
          "level": 6
        },
        {
          "name": "Eyes of Charming",
          "requires_attunement": 1,
          "level": 6
        },
        {
          "name": "Gloves of Thievery",
          "requires_attunement": 0,
          "level": 6
        },
        {
          "name": "Lantern of Revealing",
          "requires_attunement": 0,
          "level": 6
        },
        {
          "name": "Pipes of Haunting",
          "requires_attunement": 0,
          "level": 6
        },
        {
          "name": "Ring of Water Walking",
          "requires_attunement": 0,
          "level": 6
        },
        {
          "name": "Boots of Striding and Springing",
          "requires_attunement": 1,
          "level": 10
        },
        {
          "name": "Boots of the Winterlands",
          "requires_attunement": 1,
          "level": 10
        },
        {
          "name": "Bracers of Archery",
          "requires_attunement": 1,
          "level": 10
        },
        {
          "name": "Brooch of Shielding",
          "requires_attunement": 1,
          "level": 10
        },
        {
          "name": "Cloak of Protection",
          "requires_attunement": 1,
          "level": 10
        },
        {
          "name": "Eyes of the Eagle",
          "requires_attunement": 1,
          "level": 10
        },
        {
          "name": "Gauntlets of Ogre Power",
          "requires_attunement": 1,
          "level": 10
        },
        {
          "name": "Gloves of Missile Snaring",
          "requires_attunement": 1,
          "level": 10
        },
        {
          "name": "Gloves of Swimming and Climbing",
          "requires_attunement": 1,
          "level": 10
        },
        {
          "name": "Hat of Disguise",
          "requires_attunement": 1,
          "level": 10
        },
        {
          "name": "Headband of Intellect",
          "requires_attunement": 1,
          "level": 10
        },
        {
          "name": "Helm of Telepathy",
          "requires_attunement": 1,
          "level": 10
        },
        {
          "name": "Medallion of Thoughts",
          "requires_attunement": 1,
          "level": 10
        },
        {
          "name": "Necklace of Adaptation",
          "requires_attunement": 1,
          "level": 10
        },
        {
          "name": "Periapt of Wound Closure",
          "requires_attunement": 1,
          "level": 10
        },
        {
          "name": "Pipes of the Sewers",
          "requires_attunement": 1,
          "level": 10
        },
        {
          "name": "Ring of Jumping",
          "requires_attunement": 1,
          "level": 10
        },
        {
          "name": "Ring of Mind Shielding",
          "requires_attunement": 1,
          "level": 10
        },
        {
          "name": "Slippers of Spider Climbing",
          "requires_attunement": 1,
          "level": 10
        },
        {
          "name": "Ring of Water Walking",
          "requires_attunement": 0,
          "level": 10
        },
        {
          "name": "Ventilating Lungs (Eberron: Rising from the Last War)",
          "requires_attunement": 1,
          "level": 10
        },
        {
          "name": "Winged Boots",
          "requires_attunement": 1,
          "level": 10
        },
         {
          "name": "Amulet of Health",
          "requires_attunement": 1,
          "level": 14
        },
         {
          "name": "Arcane Propulsion Arm (Eberron: Rising from the Last War)",
          "requires_attunement": 1,
          "level": 14
        },
         {
          "name": "Belt of Hill Giant Strength",
          "requires_attunement": 1,
          "level": 14
        },
         {
          "name": "Boots of Levitation",
          "requires_attunement": 1,
          "level": 14
        },
         {
          "name": "Boots of Speed",
          "requires_attunement": 1,
          "level": 14
        },
         {
          "name": "Bracers of Defense",
          "requires_attunement": 1,
          "level": 14
        },
         {
          "name": "Cloak of the Bat",
          "requires_attunement": 1,
          "level": 14
        },
         {
          "name": "Dimensional Shackles",
          "requires_attunement": 0,
          "level": 14
        },
         {
          "name": "Gem of Seeing",
          "requires_attunement": 1,
          "level": 14
        },
         {
          "name": "Horn of Blasting",
          "requires_attunement": 0,
          "level": 14
        },
         {
          "name": "Ring of Free Action",
          "requires_attunement": 1,
          "level": 14
        },
         {
          "name": "Ring of Protection",
          "requires_attunement": 1,
          "level": 14
        },
         {
          "name": "Ring of the Ram",
          "requires_attunement": 1,
          "level": 14
        }

          ]
        },
         {
          "name": "Repulsion Shield",
          "level": 6,
          "desc": "Prerequisite: 6th-level artificer. Item: A shield (requires attunement). A creature gains a +1 bonus to Armor Class while wielding this shield. The shield has 4 charges. While holding it, the wielder can use a reaction immediately after being hit by a melee attack to expend 1 of the shield's charges and push the attacker up to 15 feet away. The shield regains 1d4 expended charges daily at dawn.",
          "requires_attunement": 1
        },
        {
          "name": "Resistant Armor",
          "level": 6,
          "desc": "Prerequisite: 6th-level artificer. Item: A suit of armor (requires attunement). While wearing this armor, a creature has resistance to one of the following damage types, which you choose when you infuse the item: acid, cold, fire, force, lightning, necrotic, poison, psychic, radiant, or thunder.",
          "requires_attunement": 1
        },
        {
          "name": "Returning Weapon",
          "level": 1,
          "desc": "Item: A simple or martial weapon with the thrown property. This magic weapon grants a +1 bonus to attack and damage rolls made with it, and it returns to the wielder’s hand immediately after it is used to make a ranged attack.",
          "requires_attunement": 0
        },
          {
          "name": "Spell-Refueling Ring",
          "level": 6,
          "desc": "Prerequisite: 6th-level artificer. Item: A ring (requires attunement). While wearing this ring, the creature can recover one expended spell slot as an action. The recovered slot can be of 3rd level or lower. Once used, the ring can't be used again until the next dawn.",
          "requires_attunement": 1
        }


      ],
      "subclasses": [
        {
          "name": "Alchemist",
          "features": [
            {
              "name": "Magical Tinkering",
              "desc": "desc of the thingy"
            }
          ],
          "spells": [
            {
              "level": 3,
              "name": "The Spells Name",
              "index": "the_spells_name"
            }
          ]
        }
      ]
    }
  ]
}